#Область ПрограммныйИнтерфейс

// Возвращает актуальную цену материала на указанную дату.
//
// Параметры:
//   АктуальнаяДата - Дата - Дата, на которую необходимо получить цену материала
//   ЭлементНоменклатуры - СправочникСсылка.Номенклатура - Элемент номенклатуры, для которого необходимо получить цену
//
// Возвращаемое значение:
//   Число - Актуальная цена материала
Функция ЦенаМатериалов (АктуальнаяДата, ЭлементНоменклатуры) Экспорт
	Отбор =  Новый Структура ("Номенклатура", ЭлементНоменклатуры);
	ЗначениеРесурсов = РегистрыСведений.ЦеныМатериалов.ПолучитьПоследнее(АктуальнаяДата, Отбор);
	Возврат ЗначениеРесурсов.Цена;    
КонецФункции 

// Возвращает текущий статус материала для указанного элемента номенклатуры.
//
// Параметры:
//   ЭлементНоменклатуры - СправочникСсылка.Номенклатура - Элемент номенклатуры, для которого необходимо получить статус материала
//
// Возвращаемое значение:
//   ПеречислениеСсылка.СтатусыГотовностиПродукции - Текущий статус материала
Функция СтатусМатериала (ЭлементНоменклатуры) Экспорт
	Отбор =  Новый Структура ("Номенклатура", ЭлементНоменклатуры);
	ЗначениеРесурсов = РегистрыСведений.СтатусПродукции.ПолучитьПоследнее(ТекущаяДатаСеанса(), Отбор);
	Возврат ЗначениеРесурсов.Статус;    
КонецФункции       

// Возвращает последнюю цену покупки для указанного элемента номенклатуры.
//
// Параметры:
//   ЭлементНоменклатуры - Строка - Наименование элемента номенклатуры
//
// Возвращаемое значение:
//   Число - Последняя цена покупки элемента номенклатуры
Функция ЦенаПокупки (ЭлементНоменклатуры) Экспорт
	Отбор =  Новый Структура ("Наиенование", ЭлементНоменклатуры);
	ЗначениеРесурсов = РегистрыСведений.ЦенаПокупки.ПолучитьПоследнее(ТекущаяДатаСеанса(), Отбор);
	Возврат ЗначениеРесурсов.Цена;    
КонецФункции  

// Возвращает остаток материала на складе на текущую дату сеанса.
//
// Параметры:
//   ЭлементНоменклатуры - СправочникСсылка.Номенклатура - Элемент номенклатуры, для которого необходимо получить остаток
//
// Возвращаемое значение:
//   Число - Остаток материала на складе
Функция ОстаткиМатериалов (ЭлементНоменклатуры) Экспорт
	ОстатокНаСкладе = 0;
	
	Отбор =  Новый Структура ("Наименование", ЭлементНоменклатуры);
	ЗначениеРесурсов = РегистрыНакопления.ОстаткиМатериалов.Остатки(ТекущаяДатаСеанса() , Отбор);
	
	Если ЗначениеРесурсов.Количество() > 0 Тогда 
		ОстатокНаСкладе = ЗначениеРесурсов[0].Остаток;     
	КонецЕсли; 
	
	Возврат ОстатокНаСкладе;
КонецФункции     

// Возвращает остаток в производстве для указанного документа и наименования.
//
// Параметры:
//   Ссылка - ДокументСсылка - Ссылка на документ основание
//   Наименование - СправочникСсылка.Номенклатура - Наименование, для которого рассчитывается остаток
//
// Возвращаемое значение:
//   Число - Остаток в производстве
Функция ВПроизводствеОстаток (Ссылка, Наименование) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВПроизводствеОбороты.КоличествоОборот КАК КоличествоОборот
		|ИЗ
		|	РегистрНакопления.ВПроизводстве.Обороты(, , Регистратор, ) КАК ВПроизводствеОбороты
		|ГДЕ
		|	ВПроизводствеОбороты.Наименование = &Наименование
		|	И ВПроизводствеОбороты.Регистратор.ДокументОснование.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Сумма = 0;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Сумма = Сумма + ВыборкаДетальныеЗаписи.КоличествоОборот; 
	КонецЦикла;
	Возврат Сумма;
	
КонецФункции      

// Возвращает общее количество проданного товара указанного наименования по документу.
//
// Параметры:
//   Ссылка - ДокументСсылка - ссылка на документ, по которому рассчитывается продажа
//   Наименование - СправочникСсылка.Номенклатура - наименование товара, для которого рассчитывается продажа
//
// Возвращаемое значение:
//   Число - общее количество проданного товара
Функция Продано (Ссылка, Наименование) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПроданоОбороты.КоличествоОборот КАК КоличествоОборот
		|ИЗ
		|	РегистрНакопления.Продано.Обороты(, , Регистратор, ) КАК ПроданоОбороты
		|ГДЕ
		|	ПроданоОбороты.Регистратор.ДокументОснование.Ссылка = &Ссылка
		|	И ПроданоОбороты.Номенклатура = &Номенклатура";
	
	Запрос.УстановитьПараметр("Номенклатура", Наименование);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();   
	
	Сумма = 0;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Сумма = Сумма + ВыборкаДетальныеЗаписи.КоличествоОборот; 
	КонецЦикла;  
	Возврат Сумма;

КонецФункции

// Возвращает общее количество выпущенной продукции указанного наименования 
// на основании переданной ссылки на документ.
//
// Параметры:
//   Ссылка - ДокументСсылка - ссылка на документ-основание
//   Наименование - Строка - наименование выпущенной продукции
//
// Возвращаемое значение:
//   Число - общее количество выпущенной продукции
Функция ВыпускПродукции(Ссылка, Наименование) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиМатериаловОбороты.ОстатокОборот КАК Количество
		|ИЗ
		|	РегистрНакопления.ОстаткиМатериалов.Обороты(, , Регистратор, ) КАК ОстаткиМатериаловОбороты
		|ГДЕ
		|	ОстаткиМатериаловОбороты.Наименование = &Наименование
		|	И ОстаткиМатериаловОбороты.Регистратор.ДокументОснование.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Сумма = 0;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Сумма = Сумма + ВыборкаДетальныеЗаписи.Количество; 
	КонецЦикла;
	Возврат Сумма;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьТекущуюДатуСеанса() Экспорт
	Возврат ТекущаяДатаСеанса();
КонецФункции

// Определяет возраст клиента на основе истории продаж.
//
// Параметры:
//   Контрагент - СправочникСсылка.Покупатели - клиент, для которого определяется возраст
//   Дата - Дата - дата, относительно которой определяется возраст клиента
//
// Возвращаемое значение:
//   ПеречислениеСсылка.ВозрастКлиента - возраст клиента (Новый или Старый)
Функция ВозрастКлиента(Контрагент, Дата) Экспорт 
	ТекстЗапроса1 =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ДокументПродажи.Дата КАК ПерваяПродажа
		|ИЗ
		|	Документ.ДокументПродажи КАК ДокументПродажи
		|ГДЕ
		|	ДокументПродажи.Контрагент = &Контрагент 
		|   И ДокументПродажи.ПометкаУдаления = ЛОЖЬ
		|	И НАЧАЛОПЕРИОДА(ДокументПродажи.Дата, ДЕНЬ) МЕЖДУ ДОБАВИТЬКДАТЕ(&Дата, ГОД, -1) И &Дата
		|УПОРЯДОЧИТЬ ПО 
		|	ПерваяПродажа ВОЗР";  
  
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.Текст = ТекстЗапроса1;
	РезультатЗапроса1 = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи1 = РезультатЗапроса1.Выбрать();
	ВыборкаДетальныеЗаписи1.Следующий();
	ПерваяПродажаЗаГод = ВыборкаДетальныеЗаписи1.ПерваяПродажа;
	
	ТекстЗапроса2 = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ДокументПродажи.Дата КАК ПоследняяПродажа
		|ИЗ
		|	Документ.ДокументПродажи КАК ДокументПродажи
		|ГДЕ
		|	ДокументПродажи.Контрагент = &Контрагент
		|   И ДокументПродажи.ПометкаУдаления = ЛОЖЬ
		|	И НАЧАЛОПЕРИОДА(ДокументПродажи.Дата, ДЕНЬ) МЕЖДУ ДОБАВИТЬКДАТЕ(&Дата, ГОД, -2) И ДОБАВИТЬКДАТЕ(&Дата, ГОД, -1)
		|УПОРЯДОЧИТЬ ПО 
		|	ПоследняяПродажа УБЫВ";
	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.Текст = ТекстЗапроса2;
	РезультатЗапроса2 = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи2 = РезультатЗапроса2.Выбрать();
	ВыборкаДетальныеЗаписи2.Следующий();
	ПоследняяПродажаПрошлыйГод = ВыборкаДетальныеЗаписи2.ПоследняяПродажа;
	
	Возраст = ПредопределенноеЗначение("Перечисление.ВозрастКлиента.Новый");
	
	Если НЕ ПерваяПродажаЗаГод = Неопределено Тогда
		Если НЕ ПоследняяПродажаПрошлыйГод = Неопределено Тогда 
			Дельта = ПерваяПродажаЗаГод - ПоследняяПродажаПрошлыйГод;
			Если Дельта < 31536000 Тогда Возраст = ПредопределенноеЗначение("Перечисление.ВозрастКлиента.Старый");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;		
	
	Возврат Возраст;
КонецФункции

// Создает документ реализации на основе переданного документа бизнес-процесса.
//
// Параметры:
//   ДокБП - ДокументСсылка - Документ бизнес-процесса, на основе которого создается документ реализации
//   Резерв - Булево - Признак создания документа реализации для резерва
//
// Возвращаемое значение:
//   ДокументСсылка - Ссылка на созданный документ реализации
Функция СоздатьДокументРеализации(ДокБП, Резерв) Экспорт 
	
    ДокПрод 						= Документы.РасходнаяНакладная.СоздатьДокумент();
	ДокПрод.Номер 					= ДокБП.Номер;
	ДокПрод.Дата 					= ДокБП.Дата;
	ДокПрод.Контрагент 				= НайтиКонтрагента(ДокБП.Контрагент);
	ДокПрод.Ответственный			= НайтиОтветственного(ДокБП.Ответственный);
	
	Если Не Резерв Тогда 
		ДокПрод.СтатусОбеспеченияЗаказа	= Перечисления.СтытусОбеспеченияЗаказа.Заявка;
		Для Каждого СтрокаТЗ Из ДокБП.Товары Цикл
	    	НоваяСтрокаТаблицыТовары 				= ДокПрод.Товары.Добавить();
			НоваяСтрокаТаблицыТовары.Количество		= СтрокаТЗ.Количество;
			НоваяСтрокаТаблицыТовары.ЦенаПродажи	= СтрокаТЗ.Цена;
			НоваяСтрокаТаблицыТовары.Сумма			= СтрокаТЗ.Количество * СтрокаТЗ.Цена;
			НоваяСтрокаТаблицыТовары.Номенклатура	= СоздатьНоменклатуру(СтрокаТЗ.Номенклатура);
		КонецЦикла;
	Иначе
		ДокПрод.СтатусОбеспеченияЗаказа	= Перечисления.СтытусОбеспеченияЗаказа.ВРаботе;
	КонецЕсли;
	ДокПрод.Записать(РежимЗаписиДокумента.Запись);
	
	Возврат ДокПрод.Ссылка;
	
КонецФункции

// Выполняет поиск контрагента в справочнике "Покупатели" по ИНН и возвращает ссылку на него. 
// Если контрагент не найден, создает новый элемент справочника.
//
// Параметры:
//   Контрагент - СправочникСсылка.Покупатели - контрагент, по которому выполняется поиск
//
// Возвращаемое значение:
//   СправочникСсылка.Покупатели - ссылка на найденного или созданного контрагента
Функция НайтиКонтрагента(Контрагент);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Покупатели.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Покупатели КАК Покупатели
		|ГДЕ
		|	Покупатели.Код = &ИНН";
	
	Запрос.УстановитьПараметр("ИНН", Контрагент.ИНН);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	Иначе 
		Конт 				= Справочники.Покупатели.СоздатьЭлемент();
		Конт.Наименование 	= Контрагент.Наименование;
		Конт.Код			= Контрагент.ИНН;
		Конт.Примечание		= "Создан при загрузке из БП";
		Конт.Записать();
		Возврат Конт.Ссылка;
	КонецЕсли;
	
КонецФункции

// Находит или создает нового ответственного пользователя в справочнике "Пользователи" по переданному объекту Пользователь.
//
// Параметры:
//   Пользователь - <Тип> - объект, содержащий информацию о пользователе, в частности его наименование.
//
// Возвращаемое значение:
//   СправочникСсылка.Пользователи - ссылка на найденного или созданного пользователя.
Функция НайтиОтветственного(Пользователь);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Пользователи.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	Пользователи.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Наименование", Пользователь.Наименование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	Иначе 
		Ползун 				= Справочники.Пользователи.СоздатьЭлемент();
		Ползун.Наименование = Пользователь.Наименование;
		Ползун.Записать();
		Возврат Ползун.Ссылка;
	КонецЕсли;
	
КонецФункции 

// Создает новый элемент номенклатуры на основе переданных данных.
//
// Параметры:
//   Номенклатура - Структура - Содержит данные для создания новой номенклатуры
//
// Возвращаемое значение:
//   СправочникСсылка.НоменклатураМатериалы - Ссылка на созданный элемент номенклатуры
Функция СоздатьНоменклатуру(Номенклатура);

	Товар						= Справочники.НоменклатураМатериалы.СоздатьЭлемент();
	Товар.Наименование 			= Номенклатура.Наименование;
	Товар.ТипНоменклатуры 		= Перечисления.ТипыНоменклатуры.Продукция;
	Товар.ЕдиницаИзмеренияСырья = Перечисления.ЕдиницыИзмерения.Килограмм;
	Товар.Примечание			= "*";
	Товар.Записать();
	Возврат Товар.Ссылка	
КонецФункции	

#КонецОбласти