
#Область ПолученияДанныхССервера
&НаСервереБезКонтекста
Функция ПолучитьЕдИзмМатериала(НоменклатураМатериалы) 
// Функция передает в процедуру единицу измерения материала из справочника НоменклатураМатериалы

	Возврат НоменклатураМатериалы.ЕдиницаИзмеренияСырья; 
	                     	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьНаименованиеМатериала(НоменклатураМатериалы) 
// Функция передает в процедуру единицу измерения материала из справочника НоменклатураМатериалы

	Возврат НоменклатураМатериалы.Наименование; 
	                     	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьТипМатериала(НоменклатураМатериалы) 
// Функция передает в процедуру тип материала из справочника НоменклатураМатериалы

	Возврат НоменклатураМатериалы.ТипНоменклатуры; 
	                     	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьНомерСчета(Счет) 
// Функция передает в процедуру единицу измерения материала из справочника НоменклатураМатериалы

	Возврат Счет.Номер; 
	                     	
КонецФункции
#КонецОбласти

#Область ВключениеТолькоЧтение
&НаСервере
Процедура ПриЧтенииНаСервере0(ТекущийОбъект)
	// Запрет изменения проведенного документа в статусе "закрыт"
	//Данный механизм предполагает только распроведение для редактирования документа производства.

	Если ТекущийОбъект.Проведен И Объект.СтатусЗагрузки = Перечисления.СостояниеЗагрузкиСырьяПроизводства.Обеспечено И Объект.СтатусВыпуска = Перечисления.СостояниеВыпускаПродукции.Выпущена Тогда
		ЭтаФорма.ТолькоПросмотр = Истина;		
	КонецЕсли;
	
КонецПроцедуры                              
#КонецОбласти

#Область СырьеИРецептура

&НаКлиенте
Процедура ТребуемоеКоличествоПриИзменении(Элемент)   

	Если Объект.ТребуемоеКоличество <= 0 Тогда
		
		Сообщить("Нельзя произвести " + Объект.ТребуемоеКоличество + " кг")
		
	Иначе
	
	// Процедура считает в каждой строке количество сырья, необходимое для производства и сумму каждой строки при изменении количества производства 
	СтрокаТабличнойЧасти = Элементы.РецептураСостав.ТекущиеДанные;   
	
	Объект.ЗагрузкаНаТонну1 = 0;
	
	Объект.ЗагрузкаНаТонну2 = 0; 
	
	Объект.ЗагрузкаНаТонну3 = 0;

	Объект.ЗагрузкаНаТонну4 = 0;
	
	Компонент = 1;

	Для каждого СтрокаТабличнойЧасти Из Объект.РецептураСостав Цикл

		СтрокаТабличнойЧасти.ТребуетсяДляПроизводства = ОКР(СтрокаТабличнойЧасти.КоличествоНаТонну * 0.001 * Объект.ТребуемоеКоличество + 0.999, 0, РежимОкругления.Окр15как10);
		
		СтрокаТабличнойЧасти.ЕдиницаИзмеренияЗагрузки = ПолучитьЕдИзмМатериала(СтрокаТабличнойЧасти.Материал);   
		
		 //Получает цену покупки из регистра
		 СтрокаТабличнойЧасти.Цена = РаботаСоСправочниками.ЦенаМатериалов(ТекущаяДата() , СтрокаТабличнойЧасти.Материал);

		
		Материал = ПолучитьНаименованиеМатериала(СтрокаТабличнойЧасти.Материал); 
	
		СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.ТребуетсяДляПроизводства * РаботаСоСправочниками.ЦенаМатериалов(ТекущаяДата() , СтрокаТабличнойЧасти.Материал);

		СтрокаТабличнойЧасти.ВПроизводстве = РаботаСоСправочниками.ВПроизводствеОстаток(Объект.Ссылка, СтрокаТабличнойЧасти.Материал);
		
		СтрокаТабличнойЧасти.Потребность =  СтрокаТабличнойЧасти.ТребуетсяДляПроизводства - СтрокаТабличнойЧасти.ВПроизводстве;
		
		//Ищет в таблице компонент 2
		Если Материал = "Компонент 2" Тогда 
			
			Компонент = 2;
			
		ИначеЕсли Материал = "Компонент 3" Тогда
			
			Компонент = 3;
			
		ИначеЕсли Материал = "Компонент 4" Тогда 
			
			Компонент = 4;
			
		КонецЕсли;	

		// Считает только килограммы
		Если СтрокаТабличнойЧасти.ЕдиницаИзмеренияЗагрузки = "кг" Тогда
			
			//  Основа счет загрузки
			Если Компонент = 1 Тогда
				
				Объект.ЗагрузкаНаТонну1 = Объект.ЗагрузкаНаТонну1 + СтрокаТабличнойЧасти.ТребуетсяДляПроизводства;   
		
			// Компонент 2 счет загрузки
			ИначеЕсли Компонент = 2 Тогда  
			
				Объект.ЗагрузкаНаТонну2 = Объект.ЗагрузкаНаТонну2 + СтрокаТабличнойЧасти.ТребуетсяДляПроизводства; 
				
			// Компонент 3 счет загрузки
			ИначеЕсли Компонент = 3 Тогда 
			
				Объект.ЗагрузкаНаТонну3 = Объект.ЗагрузкаНаТонну3 + СтрокаТабличнойЧасти.ТребуетсяДляПроизводства;
				
			// Компонент 4 счет загрузки	
			Иначе 

				Объект.ЗагрузкаНаТонну4 = Объект.ЗагрузкаНаТонну4 + СтрокаТабличнойЧасти.ТребуетсяДляПроизводства;	
	
			КонецЕсли;
			
		КонецЕсли;
		
		КонецЦикла;           
		
		// Считает стоимость производства
		Объект.ОбщаяСтоимостьПроизводства = Объект.РецептураСостав.Итог("Сумма") + Объект.Переработка * Объект.ТребуемоеКоличество * 0.001; 
	
		Объект.ЦенаЗаКг = Объект.ОбщаяСтоимостьПроизводства/Объект.ТребуемоеКоличество; 
		
		Объект.ЗагрузкаИтого = Объект.ЗагрузкаНаТонну1 + Объект.ЗагрузкаНаТонну2 + Объект.ЗагрузкаНаТонну3 + Объект.ЗагрузкаНаТонну4;
		
	КонецЕсли;

КонецПроцедуры     

&НаКлиенте
Процедура РецептураСоставТребуетсяДляПроизводстваПриИзменении(Элемент)
	// Процедура считает в каждой строке количество сырья, необходимое для производства и сумму каждой строки при изменении количества производства 

	СтрокаТабличнойЧасти = Элементы.РецептураСостав.ТекущиеДанные;   
	
	Объект.ЗагрузкаНаТонну1 = 0;
	
	Объект.ЗагрузкаНаТонну2 = 0; 
	
	Объект.ЗагрузкаНаТонну3 = 0;

	Объект.ЗагрузкаНаТонну4 = 0;
	
	Компонент = 1;                    
	
	//Пересчёт кол-во на тонну
	СтрокаТабличнойЧасти.КоличествоНаТонну = СтрокаТабличнойЧасти.ТребуетсяДляПроизводства * 1000 / Объект.ТребуемоеКоличество;
	 
   	//Считает сумму строки табличной части
	СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.ТребуетсяДляПроизводства * РаботаСоСправочниками.ЦенаМатериалов(ТекущаяДата() , СтрокаТабличнойЧасти.Материал);
	
	//Показывает, сколько уже списано на это производство
	СтрокаТабличнойЧасти.ВПроизводстве = РаботаСоСправочниками.ВПроизводствеОстаток(Объект.Ссылка, СтрокаТабличнойЧасти.Материал); 
	
	СтрокаТабличнойЧасти.Потребность =  СтрокаТабличнойЧасти.ТребуетсяДляПроизводства - СтрокаТабличнойЧасти.ВПроизводстве;
	
	СтрокаТабличнойЧасти.ЕдиницаИзмеренияЗагрузки = ПолучитьЕдИзмМатериала(СтрокаТабличнойЧасти.Материал);
	
	СтрокаТабличнойЧасти.Остаток = РаботаСоСправочниками.ОстаткиМатериалов(СтрокаТабличнойЧасти.Материал);
	
	Если (СтрокаТабличнойЧасти.Действие = ПредопределенноеЗначение("Перечисление.СостояниеОбеспечения.Отгружен") ИЛИ СтрокаТабличнойЧасти.Действие = ПредопределенноеЗначение("Перечисление.СостояниеОбеспечения.Отгрузить")) И СтрокаТабличнойЧасти.ТребуетсяДляПроизводства > СтрокаТабличнойЧасти.ВПроизводстве Тогда  
			
		СтрокаТабличнойЧасти.Действие = ПредопределенноеЗначение("Перечисление.СостояниеОбеспечения.КОбеспечению");  
			
	КонецЕсли;	



	Для каждого СтрокаТабличнойЧасти Из Объект.РецептураСостав Цикл

		Материал = ПолучитьНаименованиеМатериала(СтрокаТабличнойЧасти.Материал); 
		
		//Ищет в таблице компонент 2
		Если Материал = "Компонент 2" Тогда 
			
			Компонент = 2;
			
		ИначеЕсли Материал = "Компонент 3" Тогда
			
			Компонент = 3;
			
		ИначеЕсли Материал = "Компонент 4" Тогда 
			
			Компонент = 4;
			
		КонецЕсли;	

		// Считает только килограммы
		Если СтрокаТабличнойЧасти.ЕдиницаИзмеренияЗагрузки = "кг" Тогда
			
			//  Основа счет загрузки
			Если Компонент = 1 Тогда
				
				Объект.ЗагрузкаНаТонну1 = Объект.ЗагрузкаНаТонну1 + СтрокаТабличнойЧасти.КоличествоНаТонну;   
		
			// Компонент 2 счет загрузки
			ИначеЕсли Компонент = 2 Тогда  
			
				Объект.ЗагрузкаНаТонну2 = Объект.ЗагрузкаНаТонну2 + СтрокаТабличнойЧасти.КоличествоНаТонну; 
				
			// Компонент 3 счет загрузки
			ИначеЕсли Компонент = 3 Тогда 
			
				Объект.ЗагрузкаНаТонну3 = Объект.ЗагрузкаНаТонну3 + СтрокаТабличнойЧасти.КоличествоНаТонну;
				
			// Компонент 4 счет загрузки	
			Иначе 

				Объект.ЗагрузкаНаТонну4 = Объект.ЗагрузкаНаТонну4 + СтрокаТабличнойЧасти.КоличествоНаТонну;	
	
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;           
	
	// Считает стоимость производства
	Объект.ОбщаяСтоимостьПроизводства = Объект.РецептураСостав.Итог("Сумма") + Объект.Переработка * Объект.ТребуемоеКоличество * 0.001; 

	Объект.ЦенаЗаКг = Объект.ОбщаяСтоимостьПроизводства/Объект.ТребуемоеКоличество; 

	Объект.ЗагрузкаИтого = Объект.ЗагрузкаНаТонну1 + Объект.ЗагрузкаНаТонну2 + Объект.ЗагрузкаНаТонну3 + Объект.ЗагрузкаНаТонну4;

	 Если НЕ Объект.Лабораторная Тогда 
		 Если Объект.РецептураСостав.Итог("ТребуетсяДляПроизводства") > 0 И Объект.РецептураСостав.Итог("ВПроизводстве") > 0 Тогда
			 Если Объект.РецептураСостав.Итог("ТребуетсяДляПроизводства") > Объект.РецептураСостав.Итог("ВПроизводстве") Тогда
				 Объект.СтатусЗагрузки = ПредопределенноеЗначение("Перечисление.СостояниеЗагрузкиСырьяПроизводства.ЧастичноОбеспечено");
			 ИначеЕсли Объект.РецептураСостав.Итог("ТребуетсяДляПроизводства") = Объект.РецептураСостав.Итог("ВПроизводстве") Тогда	
				 Объект.СтатусЗагрузки = ПредопределенноеЗначение("Перечисление.СостояниеЗагрузкиСырьяПроизводства.Обеспечено");
			 ИначеЕсли Объект.РецептураСостав.Итог("ТребуетсяДляПроизводства") < Объект.РецептураСостав.Итог("ВПроизводстве") Тогда
				 Объект.СтатусЗагрузки = ПредопределенноеЗначение("Перечисление.СостояниеЗагрузкиСырьяПроизводства.Перегруз");
		 	 КонецЕсли;
		 КонецЕсли;	 
      КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РецептураСоставПриАктивизацииСтроки(Элемент)
	// Процедура отображает материалы "В Производстве" при нажатии мышью табличной части 

	СтрокаТабличнойЧасти = Элементы.РецептураСостав.ТекущиеДанные;   
	Для каждого СтрокаТабличнойЧасти Из Объект.РецептураСостав Цикл

		 //Получает остаток в производстве из регистра
		 СтрокаТабличнойЧасти.ВПроизводстве = РаботаСоСправочниками.ВПроизводствеОстаток(Объект.Ссылка, СтрокаТабличнойЧасти.Материал);
		 СтрокаТабличнойЧасти.Остаток = РаботаСоСправочниками.ОстаткиМатериалов(СтрокаТабличнойЧасти.Материал);
		 СтрокаТабличнойЧасти.Потребность =  СтрокаТабличнойЧасти.ТребуетсяДляПроизводства - СтрокаТабличнойЧасти.ВПроизводстве;
		 
		Если СтрокаТабличнойЧасти.ВПроизводстве = СтрокаТабличнойЧасти.ТребуетсяДляПроизводства Тогда 
			 СтрокаТабличнойЧасти.Действие = ПредопределенноеЗначение("Перечисление.СостояниеОбеспечения.Отгружен");
		КонецЕсли;
	КонецЦикла; 
	
	 Если НЕ Объект.Лабораторная Тогда 
		 Если Объект.РецептураСостав.Итог("ТребуетсяДляПроизводства") > 0 И Объект.РецептураСостав.Итог("ВПроизводстве") > 0 Тогда
			 Если Объект.РецептураСостав.Итог("ТребуетсяДляПроизводства") > Объект.РецептураСостав.Итог("ВПроизводстве") Тогда
				 Объект.СтатусЗагрузки = ПредопределенноеЗначение("Перечисление.СостояниеЗагрузкиСырьяПроизводства.ЧастичноОбеспечено");
			 ИначеЕсли Объект.РецептураСостав.Итог("ТребуетсяДляПроизводства") = Объект.РецептураСостав.Итог("ВПроизводстве") Тогда	
				 Объект.СтатусЗагрузки = ПредопределенноеЗначение("Перечисление.СостояниеЗагрузкиСырьяПроизводства.Обеспечено");
			 ИначеЕсли Объект.РецептураСостав.Итог("ТребуетсяДляПроизводства") < Объект.РецептураСостав.Итог("ВПроизводстве") Тогда
				 Объект.СтатусЗагрузки = ПредопределенноеЗначение("Перечисление.СостояниеЗагрузкиСырьяПроизводства.Перегруз");
		 	 КонецЕсли;
		 КонецЕсли;	      
	КонецЕсли;	 
КонецПроцедуры

&НаКлиенте
Процедура РецептураСоставПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование) 
	
	Если НоваяСтрока И Не Копирование Тогда
        Элемент.ТекущиеДанные.Действие = ПредопределенноеЗначение("Перечисление.СостояниеОбеспечения.КОбеспечению"); 
	КонецЕсли;  
	
КонецПроцедуры

&НаКлиенте
Процедура Отгрузить(Команда)

	СтрокаТабличнойЧасти = Элементы.РецептураСостав.ТекущиеДанные;
	
	Для каждого СтрокаТабличнойЧасти Из Объект.РецептураСостав Цикл 
		
		СтрокаТабличнойЧасти.ВПроизводстве = РаботаСоСправочниками.ВПроизводствеОстаток(Объект.Ссылка, СтрокаТабличнойЧасти.Материал);
		
		СтрокаТабличнойЧасти.Потребность =  СтрокаТабличнойЧасти.ТребуетсяДляПроизводства - СтрокаТабличнойЧасти.ВПроизводстве;
		
		Статус = ПредопределенноеЗначение("Перечисление.СостояниеОбеспечения.КОбеспечению");
		ЕдИзм = ПредопределенноеЗначение("Перечисление.ЕдиницыИзмерения.Килограмм");
		ФактНаличие = РаботаСоСправочниками.ОстаткиМатериалов(СтрокаТабличнойЧасти.Материал) + СтрокаТабличнойЧасти.ВПроизводстве;
		
		Если СтрокаТабличнойЧасти.Действие = Статус И ФактНаличие >= СтрокаТабличнойЧасти.ТребуетсяДляПроизводства И ЕдИзм = ПолучитьЕдИзмМатериала(СтрокаТабличнойЧасти.Материал) Тогда  
			
			СтрокаТабличнойЧасти.Действие = ПредопределенноеЗначение("Перечисление.СостояниеОбеспечения.Отгрузить"); 
			
		ИначеЕсли СтрокаТабличнойЧасти.Действие = ПредопределенноеЗначение("Перечисление.СостояниеОбеспечения.Отгрузить") И СтрокаТабличнойЧасти.ВПроизводстве = СтрокаТабличнойЧасти.ТребуетсяДляПроизводства Тогда
			
			СтрокаТабличнойЧасти.Действие = ПредопределенноеЗначение("Перечисление.СостояниеОбеспечения.Отгружен");
			
		КонецЕсли;	
			
	КонецЦикла;

	 Если НЕ Объект.Лабораторная Тогда 
		 Если Объект.РецептураСостав.Итог("ТребуетсяДляПроизводства") > 0 И Объект.РецептураСостав.Итог("ВПроизводстве") > 0 Тогда
			 Если Объект.РецептураСостав.Итог("ТребуетсяДляПроизводства") > Объект.РецептураСостав.Итог("ВПроизводстве") Тогда
				 Объект.СтатусЗагрузки = ПредопределенноеЗначение("Перечисление.СостояниеЗагрузкиСырьяПроизводства.ЧастичноОбеспечено");
			 ИначеЕсли Объект.РецептураСостав.Итог("ТребуетсяДляПроизводства") = Объект.РецептураСостав.Итог("ВПроизводстве") Тогда	
				 Объект.СтатусЗагрузки = ПредопределенноеЗначение("Перечисление.СостояниеЗагрузкиСырьяПроизводства.Обеспечено");
			 ИначеЕсли Объект.РецептураСостав.Итог("ТребуетсяДляПроизводства") < Объект.РецептураСостав.Итог("ВПроизводстве") Тогда
				 Объект.СтатусЗагрузки = ПредопределенноеЗначение("Перечисление.СостояниеЗагрузкиСырьяПроизводства.Перегруз");
		 	 КонецЕсли;
		 КонецЕсли;	 
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура РецептураСоставДействиеПриИзменении(Элемент)    
	
	СтрокаТабличнойЧасти = Элементы.РецептураСостав.ТекущиеДанные; 
	
	Если РаботаСоСправочниками.ОстаткиМатериалов(СтрокаТабличнойЧасти.Материал) + СтрокаТабличнойЧасти.ВПроизводстве < СтрокаТабличнойЧасти.ТребуетсяДляПроизводства Тогда
		СтрокаТабличнойЧасти.Действие = ПредопределенноеЗначение("Перечисление.СостояниеОбеспечения.КОбеспечению");
		Сообщить("Нельзя обеспечить " + СтрокаТабличнойЧасти.ТребуетсяДляПроизводства + " кг. Недостаточно на складе.")
	КонецЕсли;
		 
КонецПроцедуры

&НаКлиенте
Процедура ПереработкаПриИзменении(Элемент)
	Объект.ОбщаяСтоимостьПроизводства = Объект.РецептураСостав.Итог("Сумма") + Объект.Переработка * Объект.ТребуемоеКоличество * 0.001; 
	Объект.ЦенаЗаКг = Объект.ОбщаяСтоимостьПроизводства/Объект.ТребуемоеКоличество;  
КонецПроцедуры

&НаКлиенте
Процедура РецептураСоставМатериалПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.РецептураСостав.ТекущиеДанные;   
    СтрокаТабличнойЧасти.Остаток = РаботаСоСправочниками.ОстаткиМатериалов(СтрокаТабличнойЧасти.Материал);
	СтрокаТабличнойЧасти.Цена = РаботаСоСправочниками.ЦенаМатериалов(ТекущаяДата() , СтрокаТабличнойЧасти.Материал);

	Если НЕ Объект.Лабораторная Тогда 
		 Если Объект.РецептураСостав.Итог("ТребуетсяДляПроизводства") > 0 И Объект.РецептураСостав.Итог("ВПроизводстве") > 0 Тогда
			 Если Объект.РецептураСостав.Итог("ТребуетсяДляПроизводства") > Объект.РецептураСостав.Итог("ВПроизводстве") Тогда
				 Объект.СтатусЗагрузки = ПредопределенноеЗначение("Перечисление.СостояниеЗагрузкиСырьяПроизводства.ЧастичноОбеспечено");
			 ИначеЕсли Объект.РецептураСостав.Итог("ТребуетсяДляПроизводства") = Объект.РецептураСостав.Итог("ВПроизводстве") Тогда	
				 Объект.СтатусЗагрузки = ПредопределенноеЗначение("Перечисление.СостояниеЗагрузкиСырьяПроизводства.Обеспечено");
			 ИначеЕсли Объект.РецептураСостав.Итог("ТребуетсяДляПроизводства") < Объект.РецептураСостав.Итог("ВПроизводстве") Тогда
				 Объект.СтатусЗагрузки = ПредопределенноеЗначение("Перечисление.СостояниеЗагрузкиСырьяПроизводства.Перегруз");
		 	 КонецЕсли;
		 КонецЕсли;
	КонецЕсли;		 
		 
	 Если ПолучитьТипМатериала(СтрокаТабличнойЧасти.Материал) = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Продукция") Тогда
		 Объект.ЕстьПродукция = Истина;
	 КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура РецептураСоставКоличествоНаТоннуПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.РецептураСостав.ТекущиеДанные;
	СтрокаТабличнойЧасти.ВПроизводстве = РаботаСоСправочниками.ВПроизводствеОстаток(Объект.Ссылка, СтрокаТабличнойЧасти.Материал);
	СтрокаТабличнойЧасти.ТребуетсяДляПроизводства = СтрокаТабличнойЧасти.КоличествоНаТонну * 0.001 * Объект.ТребуемоеКоличество;
	СтрокаТабличнойЧасти.Потребность =  СтрокаТабличнойЧасти.ТребуетсяДляПроизводства - СтрокаТабличнойЧасти.ВПроизводстве; 

	 Если НЕ Объект.Лабораторная Тогда 
		 Если Объект.РецептураСостав.Итог("ТребуетсяДляПроизводства") > 0 И Объект.РецептураСостав.Итог("ВПроизводстве") > 0 Тогда
			 Если Объект.РецептураСостав.Итог("ТребуетсяДляПроизводства") > Объект.РецептураСостав.Итог("ВПроизводстве") Тогда
				 Объект.СтатусЗагрузки = ПредопределенноеЗначение("Перечисление.СостояниеЗагрузкиСырьяПроизводства.ЧастичноОбеспечено");
			 ИначеЕсли Объект.РецептураСостав.Итог("ТребуетсяДляПроизводства") = Объект.РецептураСостав.Итог("ВПроизводстве") Тогда	
				 Объект.СтатусЗагрузки = ПредопределенноеЗначение("Перечисление.СостояниеЗагрузкиСырьяПроизводства.Обеспечено");
			 ИначеЕсли Объект.РецептураСостав.Итог("ТребуетсяДляПроизводства") < Объект.РецептураСостав.Итог("ВПроизводстве") Тогда
				 Объект.СтатусЗагрузки = ПредопределенноеЗначение("Перечисление.СостояниеЗагрузкиСырьяПроизводства.Перегруз");
		 	 КонецЕсли;
		 КонецЕсли;	 
	КонецЕсли;		 
 КонецПроцедуры

&НаКлиенте
Процедура Документы(Команда)
	УсловияОтбора = Новый Структура("ДокументОснование", Объект.Ссылка);
	ПараметрыФормы = Новый Структура("Отбор, СформироватьПриОткрытии", УсловияОтбора, Истина);
	ОткрытьФорму("Отчет.ДокументыСписанияСырьяВПроизводство.Форма", ПараметрыФормы);
КонецПроцедуры

&НаКлиенте
Процедура ЛабораторнаяПриИзменении(Элемент)
	Если Объект.Лабораторная Тогда
		Объект.СтатусЗагрузки = ПредопределенноеЗначение("Перечисление.СостояниеЗагрузкиСырьяПроизводства.Обеспечено");
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

#Область Оповещения
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Документ.СпиасниеВПроизводство.Проведен" Тогда	
	
			СтрокаТабличнойЧасти = Элементы.РецептураСостав.ТекущиеДанные;
	
		Для каждого СтрокаТабличнойЧасти Из Объект.РецептураСостав Цикл 
			
			СтрокаТабличнойЧасти.ВПроизводстве = РаботаСоСправочниками.ВПроизводствеОстаток(Объект.Ссылка, СтрокаТабличнойЧасти.Материал);
			СтрокаТабличнойЧасти.Потребность =  СтрокаТабличнойЧасти.ТребуетсяДляПроизводства - СтрокаТабличнойЧасти.ВПроизводстве;
			
				Если СтрокаТабличнойЧасти.Действие = ПредопределенноеЗначение("Перечисление.СостояниеОбеспечения.Отгрузить") И СтрокаТабличнойЧасти.ВПроизводстве >= СтрокаТабличнойЧасти.ТребуетсяДляПроизводства Тогда
					СтрокаТабличнойЧасти.Действие = ПредопределенноеЗначение("Перечисление.СостояниеОбеспечения.Отгружен");
				КонецЕсли;	
				
		 КонецЦикла;
		 
		 Если НЕ Объект.Лабораторная Тогда 
			 Если Объект.РецептураСостав.Итог("ТребуетсяДляПроизводства") > 0 И Объект.РецептураСостав.Итог("ВПроизводстве") > 0 Тогда
				 Если Объект.РецептураСостав.Итог("ТребуетсяДляПроизводства") > Объект.РецептураСостав.Итог("ВПроизводстве") Тогда
					 Объект.СтатусЗагрузки = ПредопределенноеЗначение("Перечисление.СостояниеЗагрузкиСырьяПроизводства.ЧастичноОбеспечено");
				 ИначеЕсли Объект.РецептураСостав.Итог("ТребуетсяДляПроизводства") = Объект.РецептураСостав.Итог("ВПроизводстве") Тогда	
					 Объект.СтатусЗагрузки = ПредопределенноеЗначение("Перечисление.СостояниеЗагрузкиСырьяПроизводства.Обеспечено");
				 ИначеЕсли Объект.РецептураСостав.Итог("ТребуетсяДляПроизводства") < Объект.РецептураСостав.Итог("ВПроизводстве") Тогда
					 Объект.СтатусЗагрузки = ПредопределенноеЗначение("Перечисление.СостояниеЗагрузкиСырьяПроизводства.Перегруз");
			 	 КонецЕсли;
			 КонецЕсли;	 
		  КонецЕсли;
	 КонецЕсли; 
	 
	 
	 Если ИмяСобытия = "Документ.ВыпускПродукции.Проведен" Тогда 

		 СтрокаТабличнойЧасти = Элементы.Продукция1.ТекущиеДанные;
	
		Для каждого СтрокаТабличнойЧасти Из Объект.Продукция Цикл 
			СтрокаТабличнойЧасти.СостояниеОбеспечения = РаботаСоСправочниками.СтатусМатериала(СтрокаТабличнойЧасти.Наименование);
			СтрокаТабличнойЧасти.Выпущено = РаботаСоСправочниками.ВыпускПродукции(Объект.Ссылка, СтрокаТабличнойЧасти.Наименование); 
		КонецЦикла;
		
		 Если Объект.Продукция.Итог("Количество") > 0 И Объект.Продукция.Итог("Выпущено") > 0 Тогда
		     Если Объект.Продукция.Итог("Количество") > Объект.Продукция.Итог("Выпущено") Тогда
		    	 Объект.СтатусВыпуска = ПредопределенноеЗначение("Перечисление.СостояниеВыпускаПродукции.ЧастичноВыпущена");
		     ИначеЕсли Объект.Продукция.Итог("Количество") = Объект.Продукция.Итог("Выпущено") Тогда	
		    	 Объект.СтатусВыпуска = ПредопределенноеЗначение("Перечисление.СостояниеВыпускаПродукции.Выпущена");
		 	 КонецЕсли;
		 КонецЕсли;	 
		 
	  КонецЕсли;  
	  
 КонецПроцедуры
 
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("Документ.Производство.Проведен", Объект.Ссылка, ЭтотОбъект);
КонецПроцедуры
#КонецОбласти

#Область Продукция
&НаКлиенте
Процедура Продукция1НаименованиеПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.Продукция1.ТекущиеДанные;
	СтрокаТабличнойЧасти.СостояниеОбеспечения = ПредопределенноеЗначение("Перечисление.СтатусыГотовностиПродукции.ВРаботе"); 
	
		 Если Объект.Продукция.Итог("Количество") > 0 И Объект.Продукция.Итог("Выпущено") > 0 Тогда
		     Если Объект.Продукция.Итог("Количество") > Объект.Продукция.Итог("Выпущено") Тогда
		    	 Объект.СтатусВыпуска = ПредопределенноеЗначение("Перечисление.СостояниеВыпускаПродукции.ЧастичноВыпущена");
		     ИначеЕсли Объект.Продукция.Итог("Количество") = Объект.Продукция.Итог("Выпущено") Тогда	
		    	 Объект.СтатусВыпуска = ПредопределенноеЗначение("Перечисление.СостояниеВыпускаПродукции.Выпущена");
		 	 КонецЕсли;
		 КонецЕсли;
		 
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	СтрокаТабличнойЧасти = Элементы.Продукция1.ТекущиеДанные;
	
		Для каждого СтрокаТабличнойЧасти Из Объект.Продукция Цикл 
			СтрокаТабличнойЧасти.СостояниеОбеспечения = РаботаСоСправочниками.СтатусМатериала(СтрокаТабличнойЧасти.Наименование); 
			СтрокаТабличнойЧасти.Выпущено = РаботаСоСправочниками.ВыпускПродукции(Объект.Ссылка, СтрокаТабличнойЧасти.Наименование); 
		КонецЦикла;
	
		 Если Объект.Продукция.Итог("Количество") > 0 И Объект.Продукция.Итог("Выпущено") > 0 Тогда
		     Если Объект.Продукция.Итог("Количество") > Объект.Продукция.Итог("Выпущено") Тогда
		    	 Объект.СтатусВыпуска = ПредопределенноеЗначение("Перечисление.СостояниеВыпускаПродукции.ЧастичноВыпущена");
		     ИначеЕсли Объект.Продукция.Итог("Количество") = Объект.Продукция.Итог("Выпущено") Тогда	
		    	 Объект.СтатусВыпуска = ПредопределенноеЗначение("Перечисление.СостояниеВыпускаПродукции.Выпущена");
		 	 КонецЕсли;
		 КонецЕсли;
		 
КонецПроцедуры

&НаКлиенте
Процедура СчетаСчетПриИзменении(Элемент)
	//Открытие формы выбора
	СтрокаТабличнойЧасти = Элементы.Счета.ТекущиеДанные;  
    Форма = ПолучитьФорму("Документ.Рецептуры.Форма.ФормаПодбораПродукции",,ЭтотОбъект);
	Форма.Счет = СтрокаТабличнойЧасти.Счет;      
	Форма.ОткрытьМодально();
КонецПроцедуры

&НаКлиенте
Процедура Продукция1КоличествоПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.Продукция1.ТекущиеДанные;
	Для каждого СтрокаТабличнойЧасти Из Объект.Продукция Цикл 
		СтрокаТабличнойЧасти.Выпущено = РаботаСоСправочниками.ВыпускПродукции(Объект.Ссылка, СтрокаТабличнойЧасти.Наименование); 
	КонецЦикла; 
	
		 Если Объект.Продукция.Итог("Количество") > 0 И Объект.Продукция.Итог("Выпущено") > 0 Тогда
		     Если Объект.Продукция.Итог("Количество") > Объект.Продукция.Итог("Выпущено") Тогда
		    	 Объект.СтатусВыпуска = ПредопределенноеЗначение("Перечисление.СостояниеВыпускаПродукции.ЧастичноВыпущена");
		     ИначеЕсли Объект.Продукция.Итог("Количество") = Объект.Продукция.Итог("Выпущено") Тогда	
		    	 Объект.СтатусВыпуска = ПредопределенноеЗначение("Перечисление.СостояниеВыпускаПродукции.Выпущена");
		 	 КонецЕсли;
		 КонецЕсли;
		 
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Для Каждого Строка ИЗ ВыбранноеЗначение Цикл
		Если Строка.Выбор Тогда
			НоваяСтрока = Объект.Продукция.Добавить();     
		   	НоваяСтрока.Наименование = Строка.Номенклатура;
			НоваяСтрока.Количество = Строка.Количество;
			НоваяСтрока.СостояниеОбеспечения = ПредопределенноеЗначение("Перечисление.СтатусыГотовностиПродукции.ВРаботе"); 
			 
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти





