
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)   
	Оповестить("Документ.ВыпускПродукции.Проведен", Объект.Ссылка, ЭтотОбъект); 
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияНаменованиеПродукцииПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.Продукция.ТекущиеДанные;
	СтрокаТабличнойЧасти.СостояниеОбеспечения = ПредопределенноеЗначение("Перечисление.СтатусыГотовностиПродукции.ГотовКОтгрузке");
	Для каждого СтрокаТабличнойЧасти Из Объект.Продукция Цикл 
		СтрокаТабличнойЧасти.Остаток = РаботаСоСправочниками.ОстаткиМатериалов(СтрокаТабличнойЧасти.НаменованиеПродукции);
	КонецЦикла;
КонецПроцедуры
