#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыПартияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// --- (Ниже сохраняем логику автозаполнения характеристики и номенклатуры  из партии) ---
	Если ЗначениеЗаполнено(ТекущиеДанные.Партия) Тогда
		ХарактеристикаВладелец 	= ПолучениеДанныхНоменклатуры.ПолучитьВладельцаПартии(ТекущиеДанные.Партия);
		НоменклатураВладелец 	= ПолучениеДанныхНоменклатуры.ПолучитьВладельцаХарактеристики(ХарактеристикаВладелец);
		Если ЗначениеЗаполнено(ХарактеристикаВладелец) Тогда
			ТекущиеДанные.Характеристика 	= ХарактеристикаВладелец;
			ТекущиеДанные.Номенклатура 		= НоменклатураВладелец;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти