
Процедура ОбработкаПроведения(Отказ, Режим) 
	
	Движения.ОстаткиМатериалов.Записывать = Истина;  
	Движения.СтоимостьМатериалов.Записывать = Истина;

	Для Каждого ТекСтрокаТабличнаяЧасть1 Из ТабличнаяЧасть1 Цикл
		Движение = Движения.ОстаткиМатериалов.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Наименование = ТекСтрокаТабличнаяЧасть1.Номенклатура;
		Движение.Остаток = ТекСтрокаТабличнаяЧасть1.Количество;  
		
		Движение = Движения.СтоимостьМатериалов.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Материал = ТекСтрокаТабличнаяЧасть1.Номенклатура;
		Движение.Стоимость = ТекСтрокаТабличнаяЧасть1.Количество * РаботаСоСправочниками.ЦенаМатериалов(Дата, ТекСтрокаТабличнаяЧасть1.Номенклатура);

	КонецЦикла; 
	
	//Контроль остатков
	Движения.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиМатериаловОстатки.Наименование КАК Наименование,
		|	-ОстаткиМатериаловОстатки.ОстатокОстаток КАК Количество
		|ИЗ
		|	РегистрНакопления.ОстаткиМатериалов.Остатки(
		|			,
		|			Наименование В
		|				(ВЫБРАТЬ
		|					СписаниеНаВнутренниеПотребности.Номенклатура КАК Номенклатура
		|				ИЗ
		|					Документ.СписаниеНаВнутренниеПотребности.ТабличнаяЧасть1 КАК СписаниеНаВнутренниеПотребности
		|				ГДЕ
		|					СписаниеНаВнутренниеПотребности.Ссылка = &Ссылка)) КАК ОстаткиМатериаловОстатки
		|ГДЕ
		|	ОстаткиМатериаловОстатки.ОстатокОстаток < 0";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда 
		Отказ = Истина;
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Сообщить("На складе недостаточно " + ВыборкаДетальныеЗаписи.Наименование + " в количестве " + ВыборкаДетальныеЗаписи.Количество);
			
		КонецЦикла;
	КонецЕсли;


КонецПроцедуры
