
&НаКлиенте
Процедура МатериалыПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Материалы.ТекущиеДанные;	

	//Получает остаток из регистра
	СтрокаТабличнойЧасти.Остаток = РаботаСоСправочниками.ОстаткиМатериалов(СтрокаТабличнойЧасти.Номенклатура); 
	
КонецПроцедуры

&НаКлиенте
Процедура МатериалыКоличествоПриИзменении(Элемент) 
	
	СтрокаТабличнойЧасти = Элементы.Материалы.ТекущиеДанные;	

	//Получает остаток из регистра
	СтрокаТабличнойЧасти.Коррекция =  СтрокаТабличнойЧасти.Количество - СтрокаТабличнойЧасти.Остаток;   
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьизExcel(Команда)
	Форма = ПолучитьФорму("Документ.КоррекцияОстатков.Форма.ФормаЗагрузкиТаблицыИзExcel",,ЭтотОбъект);
	Форма.Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Для Каждого Строка ИЗ ВыбранноеЗначение Цикл
		Если Строка.Остаток <> Строка.ОстатокВ1С Тогда
			НоваяСтрока 				= Объект.Материалы.Добавить();     
		   	НоваяСтрока.Номенклатура 	= Строка.Номенклатура;
			НоваяСтрока.Количество	 	= Строка.Остаток;
			НоваяСтрока.Остаток 		= Строка.ОстатокВ1С;
			НоваяСтрока.Коррекция		= Строка.Остаток - Строка.ОстатокВ1С;
		КонецЕсли
	КонецЦикла; 
КонецПроцедуры
