
Функция ПолучитьОтчетПолучить(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);	
	Ответ.Заголовки["Content-Type"] = "text/html; charset=utf-8";

	ТОтчет = Отчеты.Заявки.Создать();
	ТРезультат = новый ТабличныйДокумент();
	Тотчет.СкомпоноватьРезультат(ТРезультат);	
	ВременныйФайл = ПолучитьИмяВременногоФайла(".html");
	ТРезультат.Записать(ВременныйФайл, ТипФайлаТабличногоДокумента.HTML5);
	ТекстДокHТМЛ = Новый ТекстовыйДокумент;
	ТекстДокHТМЛ.Прочитать(ВременныйФайл);
	ТекстHТМЛ = ТекстДокHТМЛ.ПолучитьТекст();
	УдалитьФайлы(ВременныйФайл);

	Ответ.УстановитьТелоИзСтроки(ТекстHТМЛ);
	Возврат Ответ;
КонецФункции
