
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Рецептуры") Тогда
		// Заполнение шапки
		ДокументОснование = ДанныеЗаполнения.Ссылка; 
		НомерДокументаОснования = ДанныеЗаполнения.Номер;
		Для Каждого ТекСтрокаРецептураСостав Из ДанныеЗаполнения.РецептураСостав Цикл
			
			ЕдИзм = ТекСтрокаРецептураСостав.ЕдиницаИзмеренияЗагрузки;
			Требуется = ТекСтрокаРецептураСостав.ТребуетсяДляПроизводства;
			ВПроизводстве = ТекСтрокаРецептураСостав.ВПроизводстве;
			Статус = ТекСтрокаРецептураСостав.Действие;
			Нехватка = Требуется - ВПроизводстве; 
			
			//Если НЕ (ЕдИзм = "-" ИЛИ Требуется = 0 ИЛИ Нехватка <= 0) Тогда
			Если НЕ (ЕдИзм = "-" ИЛИ Требуется = 0 ИЛИ Нехватка <= 0) И ТекСтрокаРецептураСостав.Действие = ПредопределенноеЗначение("Перечисление.СостояниеОбеспечения.Отгрузить") Тогда

				НоваяСтрока = ТабличнаяЧасть1.Добавить();
				НоваяСтрока.ЕдиницаИзмерения = ТекСтрокаРецептураСостав.ЕдиницаИзмеренияЗагрузки;
				НоваяСтрока.НаменованиеМатериала = ТекСтрокаРецептураСостав.Материал;
				НоваяСтрока.КоличествоМатериала = Нехватка;
				НоваяСтрока.Остаток = РаботаСоСправочниками.ОстаткиМатериалов(НоваяСтрока.НаменованиеМатериала);
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр ОстаткиМатериалов Расход
	Движения.ОстаткиМатериалов.Записывать = Истина;
	Движения.ВПроизводстве.Записывать = Истина;
	Движения.СтоимостьМатериалов.Записывать = Истина;
	Для Каждого ТекСтрокаТабличнаяЧасть1 Из ТабличнаяЧасть1 Цикл
		Движение = Движения.ОстаткиМатериалов.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Наименование = ТекСтрокаТабличнаяЧасть1.НаменованиеМатериала;
		Движение.Остаток = ТекСтрокаТабличнаяЧасть1.КоличествоМатериала;        
		
		Движение = Движения.СтоимостьМатериалов.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Материал = ТекСтрокаТабличнаяЧасть1.НаменованиеМатериала;
		Движение.Стоимость = ТекСтрокаТабличнаяЧасть1.КоличествоМатериала * РаботаСоСправочниками.ЦенаМатериалов(Дата, ТекСтрокаТабличнаяЧасть1.НаменованиеМатериала);

		
		Движение = Движения.ВПроизводстве.Добавить();
		Движение.Период = Дата;
		Движение.Наименование = ТекСтрокаТабличнаяЧасть1.НаменованиеМатериала;
		Движение.НомерПроизводства = ЭтотОбъект.НомерДокументаОснования;
		Движение.Количество = ТекСтрокаТабличнаяЧасть1.КоличествоМатериала;   
	
	КонецЦикла;

	//Контроль остатков
	Движения.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиМатериаловОстатки.Наименование КАК Наименование,
		|	-ОстаткиМатериаловОстатки.ОстатокОстаток КАК Количество
		|ИЗ
		|	РегистрНакопления.ОстаткиМатериалов.Остатки(
		|			,
		|			Наименование В
		|				(ВЫБРАТЬ
		|					СпиасниеВПроизводствоТовары.НаменованиеМатериала КАК Номенклатура
		|				ИЗ
		|					Документ.СпиасниеВПроизводство.ТабличнаяЧасть1 КАК СпиасниеВПроизводствоТовары
		|				ГДЕ
		|					СпиасниеВПроизводствоТовары.Ссылка = &Ссылка)) КАК ОстаткиМатериаловОстатки
		|ГДЕ
		|	ОстаткиМатериаловОстатки.ОстатокОстаток < 0";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда 
		Отказ = Истина;
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Сообщить("На складе недостаточно " + ВыборкаДетальныеЗаписи.Наименование + " в количестве " + ВыборкаДетальныеЗаписи.Количество);
			
		КонецЦикла;
	КонецЕсли;
				
КонецПроцедуры
