&НаСервереБезКонтекста
Функция ПолучитьМинимальныйОстаток(НоменклатураМатериалы) 
// Функция передает в процедуру реквизит минимальный остаток материала из справочника НоменклатураМатериалы

	Возврат НоменклатураМатериалы.МинимальныйОстаток; 
	                     	
КонецФункции

&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	МассивНаименований = Строки.ПолучитьКлючи();
	
	Если МассивНаименований.Количество() > 0 Тогда
		
		Если Строки[МассивНаименований[0]].Данные.Свойство("Остаток") Тогда
		    // Остатки выгружаем из регистра накоплений в список номенклатуры
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	ОстаткиМатериаловОстатки.Наименование КАК Наименование,
				|	ОстаткиМатериаловОстатки.ОстатокОстаток КАК ОстатокОстаток
				|ИЗ
				|	РегистрНакопления.ОстаткиМатериалов.Остатки(, Наименование В (&МассивНаименований)) КАК ОстаткиМатериаловОстатки";
			
			Запрос.УстановитьПараметр("МассивНаименований", МассивНаименований);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			Выборка = РезультатЗапроса.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				
				СтрокаСписка = Строки[Выборка.Наименование];
				СтрокаСписка.Данные["Остаток"] = Выборка.ОстатокОстаток;
				Если Выборка.ОстатокОстаток < ПолучитьМинимальныйОстаток(Выборка.Наименование) Тогда
					СтрокаСписка.Оформление["Остаток"].УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Красный)
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;	
			
		Если Строки[МассивНаименований[0]].Данные.Свойство("Цена") Тогда
			// Цены выгружаем из регистра сведений в список номенклатуры
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	ЦеныМатериаловСрезПоследних.Номенклатура КАК Номенклатура,
				|	ЦеныМатериаловСрезПоследних.Цена КАК Цена
				|ИЗ
				|	РегистрСведений.ЦеныМатериалов.СрезПоследних(, Номенклатура В (&МассивНаименований)) КАК ЦеныМатериаловСрезПоследних";
			
			Запрос.УстановитьПараметр("МассивНаименований", МассивНаименований);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			Выборка = РезультатЗапроса.Выбрать();
			
			Пока Выборка.Следующий() Цикл

				СтрокаСписка = Строки[Выборка.Номенклатура];
				СтрокаСписка.Данные["Цена"] = Выборка.Цена;
				
			КонецЦикла; 
		КонецЕсли;	   
		
	Если Строки[МассивНаименований[0]].Данные.Свойство("Статус") Тогда  
			
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	СтатусПродукцииСрезПоследних.Номенклатура КАК Номенклатура,
			|	СтатусПродукцииСрезПоследних.Статус КАК Статус
			|ИЗ
			|	РегистрСведений.СтатусПродукции.СрезПоследних(, Номенклатура В (&МассивНаименований)) КАК СтатусПродукцииСрезПоследних";
		
		Запрос.УстановитьПараметр("МассивНаименований", МассивНаименований);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
			Пока Выборка.Следующий() Цикл
				СтрокаСписка = Строки[Выборка.Номенклатура];
				СтрокаСписка.Данные["Статус"] = Выборка.Статус;
			КонецЦикла;
	
	КонецЕсли;	

			
		Если Строки[МассивНаименований[0]].Данные.Свойство("Потребность") Тогда
			// Потребность из регистра выгружаем в список номенклатуры
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	ПотребностьМатериаловОстатки.Наименование КАК Наименование,
				|	ПотребностьМатериаловОстатки.ПотребностьОстаток КАК ПотребностьОстаток
				|ИЗ
				|	РегистрНакопления.ПотребностьМатериалов.Остатки(, Наименование В (&МассивНаименований)) КАК ПотребностьМатериаловОстатки";
			
			Запрос.УстановитьПараметр("МассивНаименований", МассивНаименований);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			Выборка = РезультатЗапроса.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				
				СтрокаСписка = Строки[Выборка.Наименование];
				СтрокаСписка.Данные["Потребность"] = Выборка.ПотребностьОстаток;
				Если Выборка.ПотребностьОстаток > РаботаСоСправочниками.ОстаткиМатериалов(Выборка.Наименование) Тогда
					СтрокаСписка.Оформление["Потребность"].УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Красный)
				ИначеЕсли (Выборка.ПотребностьОстаток * 2) > РаботаСоСправочниками.ОстаткиМатериалов(Выборка.Наименование) Тогда
					СтрокаСписка.Оформление["Потребность"].УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Оранжевый)
				КонецЕсли;
				
			КонецЦикла;
		КонецЕсли;	
			
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СкрытьПустыеПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

