
&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	Колво = Объект.Товары.Итог("Количество");
	Продано = Объект.Товары.Итог("Продано");
	Остаток = Объект.Товары.Итог("Остаток");  
	КоличествоБольшеОстатка = 0;

	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	Для каждого СтрокаТабличнойЧасти Из Объект.Товары Цикл
		 //Считает сумму строки табличной части
		 СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.ЦенаПродажи;
		 //Получает цену покупки из регистра
		 СтрокаТабличнойЧасти.ЦенаПокупки = РаботаСоСправочниками.ЦенаМатериалов(ТекущаяДата() , СтрокаТабличнойЧасти.Номенклатура);
		 //Получает остаток из регистра
		 СтрокаТабличнойЧасти.Остаток = РаботаСоСправочниками.ОстаткиМатериалов(СтрокаТабличнойЧасти.Номенклатура); 
		 
		Если СтрокаТабличнойЧасти.Остаток < СтрокаТабличнойЧасти.Количество Тогда
			КоличествоБольшеОстатка = КоличествоБольшеОстатка + СтрокаТабличнойЧасти.Количество;
		КонецЕсли;  
		
	 КонецЦикла;

	 Если РаботаСоСправочниками.СтатусМатериала(СтрокаТабличнойЧасти.Номенклатура) = ПредопределенноеЗначение("Перечисление.СтатусыГотовностиПродукции.ПустаяСсылка") Тогда
		 СтрокаТабличнойЧасти.Действие = ПредопределенноеЗначение("Перечисление.СтатусыГотовностиПродукции.Заявка");
	 Иначе     
		 СтрокаТабличнойЧасти.Действие = РаботаСоСправочниками.СтатусМатериала(СтрокаТабличнойЧасти.Номенклатура);
	 КонецЕсли;  
	 
	 
	//Автостатус "Счета в работе"
	Если Колво > 0 Тогда
		Если Колво > Продано Тогда 
			Если Остаток = 0 Тогда 
				Объект.Отгрузка = ПредопределенноеЗначение("Перечисление.СтатусыЗаказаКлиента.НеГотов");
			ИначеЕсли КоличествоБольшеОстатка > 0 Тогда
				Объект.Отгрузка = ПредопределенноеЗначение("Перечисление.СтатусыЗаказаКлиента.ЧастичноГотов");
			ИначеЕсли КоличествоБольшеОстатка = 0 Тогда
				Объект.Отгрузка = ПредопределенноеЗначение("Перечисление.СтатусыЗаказаКлиента.Готов");
			КонецЕсли;
		ИначеЕсли  Колво = Продано Тогда 
			Объект.Отгрузка = ПредопределенноеЗначение("Перечисление.СтатусыЗаказаКлиента.Отгружен");  
		ИначеЕсли  Колво < Продано Тогда 
			Объект.Отгрузка = ПредопределенноеЗначение("Перечисление.СтатусыЗаказаКлиента.Перегруз");
		КонецЕсли;	
	КонецЕсли;
	 
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)            
	
	//Считает сумму строки табличной части
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	Для каждого СтрокаТабличнойЧасти Из Объект.Товары Цикл
		 СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.ЦенаПродажи; 
	 	 //Из Общие модули Работа со справочниками Функции Продано получаем количество отгруженного по этому счёту
		 СтрокаТабличнойЧасти.Продано = РаботаСоСправочниками.Продано(Объект.Ссылка, СтрокаТабличнойЧасти.Номенклатура);
 		 //Получает остаток из регистра
		 СтрокаТабличнойЧасти.Остаток = РаботаСоСправочниками.ОстаткиМатериалов(СтрокаТабличнойЧасти.Номенклатура);
	КонецЦикла; 
	 
	 Объект.Сумма = Объект.Товары.Итог("Сумма");

КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриАктивизацииСтроки(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	
	 Для каждого СтрокаТабличнойЧасти Из Объект.Товары Цикл    
		//Из Общие модули Работа со справочниками Функции Продано получаем количество отгруженного по этому счёту
	 	СтрокаТабличнойЧасти.Продано = РаботаСоСправочниками.Продано(Объект.Ссылка, СтрокаТабличнойЧасти.Номенклатура);
		 //Получает остаток из регистра
		СтрокаТабличнойЧасти.Остаток = РаботаСоСправочниками.ОстаткиМатериалов(СтрокаТабличнойЧасти.Номенклатура);
		 //Из Общие модули Работа со справочниками Функции СтатусМатериала получаем статус
        СтрокаТабличнойЧасти.Действие = РаботаСоСправочниками.СтатусМатериала(СтрокаТабличнойЧасти.Номенклатура);     
		
		 Если РаботаСоСправочниками.СтатусМатериала(СтрокаТабличнойЧасти.Номенклатура) = ПредопределенноеЗначение("Перечисление.СтатусыГотовностиПродукции.ПустаяСсылка") Тогда
			 СтрокаТабличнойЧасти.Действие = ПредопределенноеЗначение("Перечисление.СтатусыГотовностиПродукции.Заявка");
		 Иначе     
			 СтрокаТабличнойЧасти.Действие = РаботаСоСправочниками.СтатусМатериала(СтрокаТабличнойЧасти.Номенклатура);
		 КонецЕсли;  

	 КонецЦикла; 

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Документ.ДокументПродажи.Проведен" Тогда
		СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
		КоличествоТовара = 0;
		ПроданоТовара = 0;
		КоличествоБольшеОстатка = 0;        
		
		Для каждого СтрокаТабличнойЧасти Из Объект.Товары Цикл    
			//Из Общие модули Работа со справочниками Функции Продано получаем количество отгруженного по этому счёту
		 	СтрокаТабличнойЧасти.Продано = РаботаСоСправочниками.Продано(Объект.Ссылка, СтрокаТабличнойЧасти.Номенклатура);
			 //Получает остаток из регистра
			СтрокаТабличнойЧасти.Остаток = РаботаСоСправочниками.ОстаткиМатериалов(СтрокаТабличнойЧасти.Номенклатура);
			//Проставляет статус товара
			СтрокаТабличнойЧасти.Действие = РаботаСоСправочниками.СтатусМатериала(СтрокаТабличнойЧасти.Номенклатура);
			Если СтрокаТабличнойЧасти.Остаток < СтрокаТабличнойЧасти.Количество Тогда
				КоличествоБольшеОстатка = КоличествоБольшеОстатка + СтрокаТабличнойЧасти.Количество;
			КонецЕсли;
		КонецЦикла;      
		
		Колво = Объект.Товары.Итог("Количество");
		Продано = Объект.Товары.Итог("Продано");
		Остаток = Объект.Товары.Итог("Остаток");  
		//Автостатус "Счета в работе"
		Если Колво > 0 Тогда
			Если Колво > Продано Тогда 
				Если Остаток = 0 Тогда 
					Объект.Отгрузка = ПредопределенноеЗначение("Перечисление.СтатусыЗаказаКлиента.НеГотов");
				ИначеЕсли КоличествоБольшеОстатка > 0 Тогда
					Объект.Отгрузка = ПредопределенноеЗначение("Перечисление.СтатусыЗаказаКлиента.ЧастичноГотов");
				ИначеЕсли КоличествоБольшеОстатка = 0 Тогда
					Объект.Отгрузка = ПредопределенноеЗначение("Перечисление.СтатусыЗаказаКлиента.Готов");
				КонецЕсли;
			ИначеЕсли  Колво = Продано Тогда 
				Объект.Отгрузка = ПредопределенноеЗначение("Перечисление.СтатусыЗаказаКлиента.Отгружен");  
			ИначеЕсли  Колво < Продано Тогда 
				Объект.Отгрузка = ПредопределенноеЗначение("Перечисление.СтатусыЗаказаКлиента.Перегруз");
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;  
	
	Если ИмяСобытия = "Документ.Производство.Проведен" ИЛИ ИмяСобытия = "Документ.ВыпускПродукции.Проведен" Тогда 
		КоличествоБольшеОстатка = 0;
		СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
		Для каждого СтрокаТабличнойЧасти Из Объект.Товары Цикл 
			СтрокаТабличнойЧасти.Действие = РаботаСоСправочниками.СтатусМатериала(СтрокаТабличнойЧасти.Номенклатура); 
			//Из Общие модули Работа со справочниками Функции Продано получаем количество отгруженного по этому счёту
		 	СтрокаТабличнойЧасти.Продано = РаботаСоСправочниками.Продано(Объект.Ссылка, СтрокаТабличнойЧасти.Номенклатура);	
			 //Получает остаток из ркгистра
			СтрокаТабличнойЧасти.Остаток = РаботаСоСправочниками.ОстаткиМатериалов(СтрокаТабличнойЧасти.Номенклатура);
			Если СтрокаТабличнойЧасти.Остаток < СтрокаТабличнойЧасти.Количество Тогда
				КоличествоБольшеОстатка = КоличествоБольшеОстатка + СтрокаТабличнойЧасти.Количество;
			КонецЕсли; 
	
		КонецЦикла;    
		
		Колво = Объект.Товары.Итог("Количество");
		Продано = Объект.Товары.Итог("Продано");
		Остаток = Объект.Товары.Итог("Остаток");  
		КоличествоБольшеОстатка = 0;        
		//Автостатус "Счета в работе"
		Если Колво > 0 Тогда
			Если Колво > Продано Тогда 
				Если Остаток = 0 Тогда 
					Объект.Отгрузка = ПредопределенноеЗначение("Перечисление.СтатусыЗаказаКлиента.НеГотов");
				ИначеЕсли КоличествоБольшеОстатка > 0 Тогда
					Объект.Отгрузка = ПредопределенноеЗначение("Перечисление.СтатусыЗаказаКлиента.ЧастичноГотов");
				ИначеЕсли КоличествоБольшеОстатка = 0 Тогда
					Объект.Отгрузка = ПредопределенноеЗначение("Перечисление.СтатусыЗаказаКлиента.Готов");
				КонецЕсли;
			ИначеЕсли  Колво = Продано Тогда 
				Объект.Отгрузка = ПредопределенноеЗначение("Перечисление.СтатусыЗаказаКлиента.Отгружен");  
			ИначеЕсли  Колво < Продано Тогда 
				Объект.Отгрузка = ПредопределенноеЗначение("Перечисление.СтатусыЗаказаКлиента.Перегруз");
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;
    
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	КоличествоБольшеОстатка = 0;
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные; 
	Для каждого СтрокаТабличнойЧасти Из Объект.Товары Цикл    
		СтрокаТабличнойЧасти.Действие = РаботаСоСправочниками.СтатусМатериала(СтрокаТабличнойЧасти.Номенклатура);
		СтрокаТабличнойЧасти.Продано = РаботаСоСправочниками.Продано(Объект.Ссылка, СтрокаТабличнойЧасти.Номенклатура);
		СтрокаТабличнойЧасти.Остаток = РаботаСоСправочниками.ОстаткиМатериалов(СтрокаТабличнойЧасти.Номенклатура);
		//Проверка частичной готовности для Автостатус "Счета в работе"
		Если СтрокаТабличнойЧасти.Остаток < СтрокаТабличнойЧасти.Количество Тогда
			КоличествоБольшеОстатка = КоличествоБольшеОстатка + СтрокаТабличнойЧасти.Количество;
		КонецЕсли;   
		//Проверка соответствия статуса Товара	
		Если СтрокаТабличнойЧасти.Остаток > 0 Тогда 
			СтрокаТабличнойЧасти.Действие = ПредопределенноеЗначение("Перечисление.СтатусыГотовностиПродукции.ГотовКОтгрузке");
		//ИначеЕсли СтрокаТабличнойЧасти.Количество = СтрокаТабличнойЧасти.Продано Тогда
		//    СтрокаТабличнойЧасти.Действие = ПредопределенноеЗначение("Перечисление.СтатусыГотовностиПродукции.Отгружен");
		КонецЕсли;		
	КонецЦикла;    
	
	Колво = Объект.Товары.Итог("Количество");
	Продано = Объект.Товары.Итог("Продано");
	Остаток = Объект.Товары.Итог("Остаток");  
	//Автостатус "Счета в работе"
	Если Колво > 0 Тогда
		Если Колво > Продано Тогда 
			Если Остаток = 0 Тогда 
				Объект.Отгрузка = ПредопределенноеЗначение("Перечисление.СтатусыЗаказаКлиента.НеГотов");
			ИначеЕсли КоличествоБольшеОстатка > 0 Тогда
				Объект.Отгрузка = ПредопределенноеЗначение("Перечисление.СтатусыЗаказаКлиента.ЧастичноГотов");
			ИначеЕсли КоличествоБольшеОстатка = 0 Тогда
				Объект.Отгрузка = ПредопределенноеЗначение("Перечисление.СтатусыЗаказаКлиента.Готов");
			КонецЕсли;
		ИначеЕсли  Колво = Продано Тогда 
			Объект.Отгрузка = ПредопределенноеЗначение("Перечисление.СтатусыЗаказаКлиента.Отгружен");  
		ИначеЕсли  Колво < Продано Тогда 
			Объект.Отгрузка = ПредопределенноеЗначение("Перечисление.СтатусыЗаказаКлиента.Перегруз");
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	Колво = Объект.Товары.Итог("Количество");
	Продано = Объект.Товары.Итог("Продано");
	Остаток = Объект.Товары.Итог("Остаток");  
	КоличествоБольшеОстатка = 0;
	//СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные; 
	//Для каждого СтрокаТабличнойЧасти Из Объект.Товары Цикл    
	//	СтрокаТабличнойЧасти.Действие = РаботаСоСправочниками.СтатусМатериала(СтрокаТабличнойЧасти.Номенклатура); 
	////Проверка частичной готовности для Автостатус "Счета в работе"
	//	Если СтрокаТабличнойЧасти.Остаток < СтрокаТабличнойЧасти.Количество Тогда
	//		КоличествоБольшеОстатка = КоличествоБольшеОстатка + СтрокаТабличнойЧасти.Количество;
	//	КонецЕсли;
	//КонецЦикла; 
	
	//Автостатус "Счета в работе"
	Если Колво > 0 Тогда
		Если Колво > Продано Тогда 
			Если Остаток = 0 Тогда 
				Объект.Отгрузка = ПредопределенноеЗначение("Перечисление.СтатусыЗаказаКлиента.НеГотов");
			ИначеЕсли КоличествоБольшеОстатка > 0 Тогда
				Объект.Отгрузка = ПредопределенноеЗначение("Перечисление.СтатусыЗаказаКлиента.ЧастичноГотов");
			ИначеЕсли КоличествоБольшеОстатка = 0 Тогда
				Объект.Отгрузка = ПредопределенноеЗначение("Перечисление.СтатусыЗаказаКлиента.Готов");
			КонецЕсли;
		ИначеЕсли  Колво = Продано Тогда 
			Объект.Отгрузка = ПредопределенноеЗначение("Перечисление.СтатусыЗаказаКлиента.Отгружен");  
		ИначеЕсли  Колво < Продано Тогда 
			Объект.Отгрузка = ПредопределенноеЗначение("Перечисление.СтатусыЗаказаКлиента.Перегруз");
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	Для каждого СтрокаТабличнойЧасти Из Объект.Товары Цикл
		Если НЕ РаботаСоСправочниками.СтатусМатериала(СтрокаТабличнойЧасти.Номенклатура) = ПредопределенноеЗначение("Перечисление.СтатусыГотовностиПродукции.ПустаяСсылка") Тогда
			 СтрокаТабличнойЧасти.Действие = РаботаСоСправочниками.СтатусМатериала(СтрокаТабличнойЧасти.Номенклатура);
		КонецЕсли; 
	КонецЦикла; 
	 
КонецПроцедуры

