#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Документ.ДокументПродажи.Проведен" Тогда
		СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
		КоличествоБольшеОстатка = 0;        
		
		Для каждого СтрокаТабличнойЧасти Из Объект.Товары Цикл    
			//Из Общие модули Работа со справочниками Функции Продано получаем количество отгруженного по этому счёту
		 	СтрокаТабличнойЧасти.Продано = РаботаСоСправочниками.Продано(Объект.Ссылка, СтрокаТабличнойЧасти.Номенклатура);
			 //Получает остаток из регистра
			СтрокаТабличнойЧасти.Остаток = РаботаСоСправочниками.ОстаткиМатериалов(СтрокаТабличнойЧасти.Номенклатура);
			Если СтрокаТабличнойЧасти.Остаток < СтрокаТабличнойЧасти.Количество Тогда
				КоличествоБольшеОстатка = КоличествоБольшеОстатка + СтрокаТабличнойЧасти.Количество;
			КонецЕсли;
		КонецЦикла;      
		
		Колво = Объект.Товары.Итог("Количество");
		Продано = Объект.Товары.Итог("Продано");
		Остаток = Объект.Товары.Итог("Остаток");  
		//Автостатус "Счета в работе"
		Если Колво > 0 Тогда
			Если Колво > Продано Тогда 
				Если Остаток = 0 Тогда 
					Объект.Отгрузка = ПредопределенноеЗначение("Перечисление.СтатусыЗаказаКлиента.НеГотов");
				ИначеЕсли КоличествоБольшеОстатка > 0 Тогда
					Объект.Отгрузка = ПредопределенноеЗначение("Перечисление.СтатусыЗаказаКлиента.ЧастичноГотов");
				ИначеЕсли КоличествоБольшеОстатка = 0 Тогда
					Объект.Отгрузка = ПредопределенноеЗначение("Перечисление.СтатусыЗаказаКлиента.Готов");
				КонецЕсли;
			ИначеЕсли  Колво = Продано Тогда 
				Объект.Отгрузка = ПредопределенноеЗначение("Перечисление.СтатусыЗаказаКлиента.Отгружен");  
			ИначеЕсли  Колво < Продано Тогда 
				Объект.Отгрузка = ПредопределенноеЗначение("Перечисление.СтатусыЗаказаКлиента.Перегруз");
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;  
	
	Если ИмяСобытия = "Документ.Производство.Проведен" ИЛИ ИмяСобытия = "Документ.ВыпускПродукции.Проведен" Тогда 
		КоличествоБольшеОстатка = 0;
		СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
		Для каждого СтрокаТабличнойЧасти Из Объект.Товары Цикл 
			СтрокаТабличнойЧасти.Действие = РаботаСоСправочниками.СтатусМатериала(СтрокаТабличнойЧасти.Номенклатура); 
			//Из Общие модули Работа со справочниками Функции Продано получаем количество отгруженного по этому счёту
		 	СтрокаТабличнойЧасти.Продано = РаботаСоСправочниками.Продано(Объект.Ссылка, СтрокаТабличнойЧасти.Номенклатура);	
			 //Получает остаток из ркгистра
			СтрокаТабличнойЧасти.Остаток = РаботаСоСправочниками.ОстаткиМатериалов(СтрокаТабличнойЧасти.Номенклатура);
			Если СтрокаТабличнойЧасти.Остаток < СтрокаТабличнойЧасти.Количество Тогда
				КоличествоБольшеОстатка = КоличествоБольшеОстатка + СтрокаТабличнойЧасти.Количество;
			КонецЕсли; 
	
		КонецЦикла;    
		
		Колво = Объект.Товары.Итог("Количество");
		Продано = Объект.Товары.Итог("Продано");
		Остаток = Объект.Товары.Итог("Остаток");  
		КоличествоБольшеОстатка = 0;        
		//Автостатус "Счета в работе"
		Если Колво > 0 Тогда
			Если Колво > Продано Тогда 
				Если Остаток = 0 Тогда 
					Объект.Отгрузка = ПредопределенноеЗначение("Перечисление.СтатусыЗаказаКлиента.НеГотов");
				ИначеЕсли КоличествоБольшеОстатка > 0 Тогда
					Объект.Отгрузка = ПредопределенноеЗначение("Перечисление.СтатусыЗаказаКлиента.ЧастичноГотов");
				ИначеЕсли КоличествоБольшеОстатка = 0 Тогда
					Объект.Отгрузка = ПредопределенноеЗначение("Перечисление.СтатусыЗаказаКлиента.Готов");
				КонецЕсли;
			ИначеЕсли  Колво = Продано Тогда 
				Объект.Отгрузка = ПредопределенноеЗначение("Перечисление.СтатусыЗаказаКлиента.Отгружен");  
			ИначеЕсли  Колво < Продано Тогда 
				Объект.Отгрузка = ПредопределенноеЗначение("Перечисление.СтатусыЗаказаКлиента.Перегруз");
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;
    
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	КоличествоБольшеОстатка = 0;
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные; 
	Для каждого СтрокаТабличнойЧасти Из Объект.Товары Цикл    
		СтрокаТабличнойЧасти.Действие = РаботаСоСправочниками.СтатусМатериала(СтрокаТабличнойЧасти.Номенклатура);
		СтрокаТабличнойЧасти.Продано = РаботаСоСправочниками.Продано(Объект.Ссылка, СтрокаТабличнойЧасти.Номенклатура);
		СтрокаТабличнойЧасти.Остаток = РаботаСоСправочниками.ОстаткиМатериалов(СтрокаТабличнойЧасти.Номенклатура);
		//Проверка частичной готовности для Автостатус "Счета в работе"
		Если СтрокаТабличнойЧасти.Остаток < СтрокаТабличнойЧасти.Количество Тогда
			КоличествоБольшеОстатка = КоличествоБольшеОстатка + СтрокаТабличнойЧасти.Количество;
		КонецЕсли;   
		//Проверка соответствия статуса Товара	
		Если СтрокаТабличнойЧасти.Остаток > 0 Тогда 
			СтрокаТабличнойЧасти.Действие = ПредопределенноеЗначение("Перечисление.СтатусыГотовностиПродукции.ГотовКОтгрузке");
		//ИначеЕсли СтрокаТабличнойЧасти.Количество = СтрокаТабличнойЧасти.Продано Тогда
		//    СтрокаТабличнойЧасти.Действие = ПредопределенноеЗначение("Перечисление.СтатусыГотовностиПродукции.Отгружен");
		КонецЕсли;		
	КонецЦикла;    
	
	Колво = Объект.Товары.Итог("Количество");
	Продано = Объект.Товары.Итог("Продано");
	Остаток = Объект.Товары.Итог("Остаток");  
	//Автостатус "Счета в работе"
	Если Колво > 0 Тогда
		Если Колво > Продано Тогда 
			Если Остаток = 0 Тогда 
				Объект.Отгрузка = ПредопределенноеЗначение("Перечисление.СтатусыЗаказаКлиента.НеГотов");
			ИначеЕсли КоличествоБольшеОстатка > 0 Тогда
				Объект.Отгрузка = ПредопределенноеЗначение("Перечисление.СтатусыЗаказаКлиента.ЧастичноГотов");
			ИначеЕсли КоличествоБольшеОстатка = 0 Тогда
				Объект.Отгрузка = ПредопределенноеЗначение("Перечисление.СтатусыЗаказаКлиента.Готов");
			КонецЕсли;
		ИначеЕсли  Колво = Продано Тогда 
			Объект.Отгрузка = ПредопределенноеЗначение("Перечисление.СтатусыЗаказаКлиента.Отгружен");  
		ИначеЕсли  Колво < Продано Тогда 
			Объект.Отгрузка = ПредопределенноеЗначение("Перечисление.СтатусыЗаказаКлиента.Перегруз");
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры



&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// Обновляем данные о производстве каждый раз, когда читаем документ из базы
	РассчитатьОстаткиКПроизводствуНаСервере();
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	Колво = Объект.Товары.Итог("Количество");
	Продано = Объект.Товары.Итог("Продано");
	Остаток = Объект.Товары.Итог("Остаток");  
	КоличествоБольшеОстатка = 0;

	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	Для каждого СтрокаТабличнойЧасти Из Объект.Товары Цикл
		 //Считает сумму строки табличной части
		 СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.ЦенаПродажи;
		 //Получает цену покупки из регистра
		 СтрокаТабличнойЧасти.ЦенаПокупки = РаботаСоСправочниками.ЦенаМатериалов(РаботаСоСправочниками.ПолучитьТекущуюДатуСеанса(), СтрокаТабличнойЧасти.Номенклатура);
		 //Получает остаток из регистра
		 СтрокаТабличнойЧасти.Остаток = РаботаСоСправочниками.ОстаткиМатериалов(СтрокаТабличнойЧасти.Номенклатура); 
		 
		Если СтрокаТабличнойЧасти.Остаток < СтрокаТабличнойЧасти.Количество Тогда
			КоличествоБольшеОстатка = КоличествоБольшеОстатка + СтрокаТабличнойЧасти.Количество;
		КонецЕсли;  
		
	 КонецЦикла;

	 Если РаботаСоСправочниками.СтатусМатериала(СтрокаТабличнойЧасти.Номенклатура) = ПредопределенноеЗначение("Перечисление.СтатусыГотовностиПродукции.ПустаяСсылка") Тогда
		 СтрокаТабличнойЧасти.Действие = ПредопределенноеЗначение("Перечисление.СтатусыГотовностиПродукции.Заявка");
	 КонецЕсли;  
	 
	 
	//Автостатус "Счета в работе"
	Если Колво > 0 Тогда
		Если Колво > Продано Тогда 
			Если Остаток = 0 Тогда 
				Объект.Отгрузка = ПредопределенноеЗначение("Перечисление.СтатусыЗаказаКлиента.НеГотов");
			ИначеЕсли КоличествоБольшеОстатка > 0 Тогда
				Объект.Отгрузка = ПредопределенноеЗначение("Перечисление.СтатусыЗаказаКлиента.ЧастичноГотов");
			ИначеЕсли КоличествоБольшеОстатка = 0 Тогда
				Объект.Отгрузка = ПредопределенноеЗначение("Перечисление.СтатусыЗаказаКлиента.Готов");
			КонецЕсли;
		ИначеЕсли  Колво = Продано Тогда 
			Объект.Отгрузка = ПредопределенноеЗначение("Перечисление.СтатусыЗаказаКлиента.Отгружен");  
		ИначеЕсли  Колво < Продано Тогда 
			Объект.Отгрузка = ПредопределенноеЗначение("Перечисление.СтатусыЗаказаКлиента.Перегруз");
		КонецЕсли;	
	КонецЕсли;
	 
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)            
	
	//Считает сумму строки табличной части
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	Для каждого СтрокаТабличнойЧасти Из Объект.Товары Цикл
		 //СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.ЦенаПродажи; 
	 	 //Из Общие модули Работа со справочниками Функции Продано получаем количество отгруженного по этому счёту
		 СтрокаТабличнойЧасти.Продано = РаботаСоСправочниками.Продано(Объект.Ссылка, СтрокаТабличнойЧасти.Номенклатура);
 		 //Получает остаток из регистра
		 СтрокаТабличнойЧасти.Остаток = РаботаСоСправочниками.ОстаткиМатериалов(СтрокаТабличнойЧасти.Номенклатура);
	КонецЦикла; 
	 
	 Объект.Сумма = Объект.Товары.Итог("Сумма");

КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриАктивизацииСтроки(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	
	 Для каждого СтрокаТабличнойЧасти Из Объект.Товары Цикл    
		//Из Общие модули Работа со справочниками Функции Продано получаем количество отгруженного по этому счёту
	 	СтрокаТабличнойЧасти.Продано = РаботаСоСправочниками.Продано(Объект.Ссылка, СтрокаТабличнойЧасти.Номенклатура);
		 //Получает остаток из регистра
		СтрокаТабличнойЧасти.Остаток = РаботаСоСправочниками.ОстаткиМатериалов(СтрокаТабличнойЧасти.Номенклатура);
	 КонецЦикла; 

КонецПроцедуры


&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.ЦенаПродажи;	
	
	Колво = Объект.Товары.Итог("Количество");
	Продано = Объект.Товары.Итог("Продано");
	Остаток = Объект.Товары.Итог("Остаток");  
	КоличествоБольшеОстатка = 0;
	
	//Автостатус "Счета в работе"
	Если Колво > 0 Тогда
		Если Колво > Продано Тогда 
			Если Остаток = 0 Тогда 
				Объект.Отгрузка = ПредопределенноеЗначение("Перечисление.СтатусыЗаказаКлиента.НеГотов");
			ИначеЕсли КоличествоБольшеОстатка > 0 Тогда
				Объект.Отгрузка = ПредопределенноеЗначение("Перечисление.СтатусыЗаказаКлиента.ЧастичноГотов");
			ИначеЕсли КоличествоБольшеОстатка = 0 Тогда
				Объект.Отгрузка = ПредопределенноеЗначение("Перечисление.СтатусыЗаказаКлиента.Готов");
			КонецЕсли;
		ИначеЕсли  Колво = Продано Тогда 
			Объект.Отгрузка = ПредопределенноеЗначение("Перечисление.СтатусыЗаказаКлиента.Отгружен");  
		ИначеЕсли  Колво < Продано Тогда 
			Объект.Отгрузка = ПредопределенноеЗначение("Перечисление.СтатусыЗаказаКлиента.Перегруз");
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

// Пересчитывает цену продажи товара при изменении суммы в табличной части.
//
// Параметры:
//   Элемент - Число - Элемент управления, вызвавший событие изменения.
&НаКлиенте
Процедура ТоварыСуммаПриИзменении(Элемент)

	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	Если СтрокаТабличнойЧасти.Количество = 0 Тогда
		СтрокаТабличнойЧасти.ЦенаПродажи = 0;
	Иначе
		СтрокаТабличнойЧасти.ЦенаПродажи = СтрокаТабличнойЧасти.Сумма / СтрокаТабличнойЧасти.Количество;
	КонецЕсли;

КонецПроцедуры


// Пересчитывает сумму строки табличной части "Товары" при изменении цены продажи.
//
// Параметры:
//   Элемент - Число - Элемент управления, вызвавший событие.
&НаКлиенте
Процедура ТоварыЦенаПродажиПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.ЦенаПродажи;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура РассчитатьОстаткиКПроизводствуНаСервере()
    
    // Запрос для получения текущих долгов производства по этому Счету
    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ
        |   ЗаказыРезервыОстатки.Номенклатура КАК Номенклатура,
        |   ЗаказыРезервыОстатки.Цвет КАК Цвет,
        |   ЗаказыРезервыОстатки.RAL КАК RAL,
        |   ЗаказыРезервыОстатки.Фасовка КАК Фасовка,
        |   ЗаказыРезервыОстатки.КоличествоОстаток КАК ОстатокКПроизводству
        |ИЗ
        |   РегистрНакопления.ЗаказыРезервы.Остатки(
        |       ,
        |       Счет = &СчетНаОплату
        |   ) КАК ЗаказыРезервыОстатки";
        
    Запрос.УстановитьПараметр("СчетНаОплату", Объект.Ссылка);
    ТаблицаОстатков = Запрос.Выполнить().Выгрузить();
    
    // Заполняем виртуальную колонку в табличной части на форме
    Для Каждого СтрокаТЧ Из Объект.Товары Цикл
        
        // Ищем соответствующую строку в остатках (учитывая все характеристики)
        СтруктураПоиска = Новый Структура("Номенклатура, Цвет, RAL, Фасовка");
        ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаТЧ);
        
        НайденныеСтроки = ТаблицаОстатков.НайтиСтроки(СтруктураПоиска);
        
        Если НайденныеСтроки.Количество() > 0 Тогда
            СтрокаТЧ.ОсталосьПроизвести = НайденныеСтроки[0].ОстатокКПроизводству;
        Иначе
            // Если остатка в регистре нет, значит цех выпустил весь объем (или заказ еще не проведен)
            Если Объект.Проведен Тогда
                СтрокаТЧ.ОсталосьПроизвести = 0; 
            Иначе
                СтрокаТЧ.ОсталосьПроизвести = СтрокаТЧ.Количество;
            КонецЕсли;
        КонецЕсли;
        
    КонецЦикла;
    
КонецПроцедуры
#КонецОбласти