#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ФасовкаПриИзменении(Элемент)
	СформироватьНаименованиеНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура RALПриИзменении(Элемент)
	СформироватьНаименованиеНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ЦветПриИзменении(Элемент)
	СформироватьНаименованиеНаКлиенте();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура СформироватьНаименованиеНаКлиенте()
	
	// Если это загрузка данных (например, обмен), обычно логику не прерывают
	//Если ОбменДанными.Загрузка Тогда
	//	Возврат;
	//КонецЕсли;
	
	ЧастиИмени = Новый Массив;
	
	// 1. Цвет
	Если ЗначениеЗаполнено(Объект.Цвет) Тогда
		ЧастиИмени.Добавить(Строка(Объект.Цвет));
	КонецЕсли;
	
	// 2. RAL
	Если ЗначениеЗаполнено(Объект.RAL) Тогда
		ТекстRAL = Строка(Объект.RAL);
		Если СтрНайти(ВРег(ТекстRAL), "RAL") = 0 Тогда
			ТекстRAL = "RAL " + ТекстRAL;
		КонецЕсли;
		ЧастиИмени.Добавить(ТекстRAL);
	КонецЕсли;
	
	// 3. Упаковка
	Если ЗначениеЗаполнено(Объект.Фасовка) Тогда
		ЧастиИмени.Добавить(Строка(Объект.Фасовка));
	КонецЕсли;

	
	// Собираем итоговую строку
	Объект.Наименование = СтрСоединить(ЧастиИмени, " ");
	
КонецПроцедуры

#КонецОбласти
