&НаСервереБезКонтекста
Функция ПолучитьЕдИзмМатериала(НоменклатураМатериалы) 
// Функция передает в процедуру единицу измерения материала из справочника НоменклатураМатериалы

	Возврат НоменклатураМатериалы.ЕдиницаИзмеренияСырья; 
	                     	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьНаименованиеМатериала(НоменклатураМатериалы) 
// Функция передает в процедуру единицу измерения материала из справочника НоменклатураМатериалы

	Возврат НоменклатураМатериалы.Наименование; 
	                     	
КонецФункции

&НаКлиенте
Процедура СоставМатериалПриИзменении(Элемент)

	СтрокаТабличнойЧасти = Элементы.Состав.ТекущиеДанные;	

	СтрокаТабличнойЧасти.ЕдиницаИзмеренияЗагрузки = ПолучитьЕдИзмМатериала(СтрокаТабличнойЧасти.Материал);

	//Получает остаток из регистра
	СтрокаТабличнойЧасти.Остаток = РаботаСоСправочниками.ОстаткиМатериалов(СтрокаТабличнойЧасти.Материал); 
	
	//Получает цену покупки из регистра
	СтрокаТабличнойЧасти.Цена = РаботаСоСправочниками.ЦенаМатериалов(ТекущаяДата() , СтрокаТабличнойЧасти.Материал);

КонецПроцедуры

&НаКлиенте
Процедура СоставКоличествоНаТоннуПриИзменении(Элемент) 
	
	СтрокаТабличнойЧасти = Элементы.Состав.ТекущиеДанные;	
	
	Объект.Загрузка1 = 0;
	
	Объект.Загрузка2 = 0; 
	
	Объект.Загрузка3 = 0;

	Объект.Загрузка4 = 0;
	
	Объект.Компонент1 = 1000;
	
	Компонент = 1;
	
	Для каждого СтрокаТабличнойЧасти Из Объект.Состав Цикл

		Материал = ПолучитьНаименованиеМатериала(СтрокаТабличнойЧасти.Материал); 

		СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.КоличествоНаТонну * СтрокаТабличнойЧасти.Цена;
		
		//Ищет в таблице компонент 2
		Если Материал = "Компонент 2" Тогда 
			
			Компонент = 2;
			
		ИначеЕсли Материал = "Компонент 3" Тогда
			
			Компонент = 3;
			
		ИначеЕсли Материал = "Компонент 4" Тогда 
			
			Компонент = 4;
			
		КонецЕсли;	

		// Считает только килограммы
		Если СтрокаТабличнойЧасти.ЕдиницаИзмеренияЗагрузки = "кг" Тогда
			
			//  Основа счет загрузки
			Если Компонент = 1 Тогда
				
				Объект.Загрузка1 = Объект.Загрузка1 + СтрокаТабличнойЧасти.КоличествоНаТонну;   
		
			// Компонент 2 счет загрузки
			ИначеЕсли Компонент = 2 Тогда  
			
				Объект.Загрузка2 = Объект.Загрузка2 + СтрокаТабличнойЧасти.КоличествоНаТонну; 
				
			// Компонент 3 счет загрузки
			ИначеЕсли Компонент = 3 Тогда 
			
				Объект.Загрузка3 = Объект.Загрузка3 + СтрокаТабличнойЧасти.КоличествоНаТонну;
				
			// Компонент 4 счет загрузки	
			Иначе 

				Объект.Загрузка4 = Объект.Загрузка4 + СтрокаТабличнойЧасти.КоличествоНаТонну;	
	
			КонецЕсли;
			
		КонецЕсли;
		
		КонецЦикла;           
		
		// Считает стоимость производства
		Объект.ОбщаяСтоимостьПроизводства = Объект.Состав.Итог("Сумма") + Объект.Переработка; 
		
		Объект.Компонент2 = Объект.Загрузка2;
		
		Объект.Компонент3 = Объект.Загрузка3;

		Объект.Компонент4 = Объект.Загрузка4;
        	
		Объект.КомпонентСумма = Объект.Компонент1 + Объект.Компонент2 + Объект.Компонент3 + Объект.Компонент4;
	
		Объект.ЦенаЗаКг = Объект.ОбщаяСтоимостьПроизводства / Объект.КомпонентСумма;  
		
		Объект.ЗагрузкаИтого = Объект.Загрузка1 + Объект.Загрузка2 + Объект.Загрузка3 + Объект.Загрузка4;

		
КонецПроцедуры

&НаКлиенте
Процедура ПереработкаПриИзменении(Элемент) 
	
		Объект.Компонент1 = 1000;
	
		Объект.КомпонентСумма = Объект.Компонент1 + Объект.Компонент2 + Объект.Компонент3 + Объект.Компонент4;
	
		Объект.ОбщаяСтоимостьПроизводства = Объект.Состав.Итог("Сумма") + Объект.Переработка; 
	
		Объект.ЦенаЗаКг = Объект.ОбщаяСтоимостьПроизводства / Объект.КомпонентСумма;  
		
КонецПроцедуры

&НаКлиенте
Процедура ОбновлениеЦены(Команда)
	
	СтрокаТабличнойЧасти = Элементы.Состав.ТекущиеДанные;
	
	Если НЕ СтрокаТабличнойЧасти = Неопределено Тогда
		//Получает цену покупки из регистра
		СтрокаТабличнойЧасти.Цена = РаботаСоСправочниками.ЦенаМатериалов(ТекущаяДата() , СтрокаТабличнойЧасти.Материал);   
		
		Объект.ОбщаяСтоимостьПроизводства = Объект.Состав.Итог("Сумма") + Объект.Переработка; 
		
		Объект.ЦенаЗаКг = Объект.ОбщаяСтоимостьПроизводства / Объект.КомпонентСумма;  
	КонецЕсли;

	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)  
	
	СтрокаТабличнойЧасти = Элементы.Состав.ТекущиеДанные;
	Если НЕ СтрокаТабличнойЧасти = Неопределено Тогда
		Для каждого СтрокаТабличнойЧасти Из Объект.Состав Цикл 
		//Получает остаток из регистра
		СтрокаТабличнойЧасти.Остаток = РаботаСоСправочниками.ОстаткиМатериалов(СтрокаТабличнойЧасти.Материал); 
		КонецЦикла;    
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузкаИзExcel(Команда)
	Форма = ПолучитьФорму("Документ.Рецепт.Форма.ФормаЗагрузкиТабличногоДокумента",,ЭтотОбъект);
	Форма.Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Для Каждого Строка ИЗ ВыбранноеЗначение Цикл
		НоваяСтрока = Объект.Состав.Добавить();     
	   	НоваяСтрока.Материал = Строка.Номенклатура;
		НоваяСтрока.КоличествоНаТонну = Строка.Количество;
	КонецЦикла; 
	
	СтрокаТабличнойЧасти = Элементы.Состав.ТекущиеДанные;	
	Объект.Загрузка1 = 0;
	Объект.Загрузка2 = 0; 
	Объект.Загрузка3 = 0;
	Объект.Загрузка4 = 0;
	Объект.Компонент1 = 1000;
	
	Компонент = 1;
	
	Для каждого СтрокаТабличнойЧасти Из Объект.Состав Цикл   
			//Получает остаток из регистра
		СтрокаТабличнойЧасти.Остаток = РаботаСоСправочниками.ОстаткиМатериалов(СтрокаТабличнойЧасти.Материал); 
		//Получает цену покупки из регистра
		СтрокаТабличнойЧасти.Цена = РаботаСоСправочниками.ЦенаМатериалов(ТекущаяДата() , СтрокаТабличнойЧасти.Материал);

		Материал = ПолучитьНаименованиеМатериала(СтрокаТабличнойЧасти.Материал); 
		СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.КоличествоНаТонну * СтрокаТабличнойЧасти.Цена;
		//Ищет в таблице компонент 2
		Если Материал = "Компонент 2" Тогда 
			Компонент = 2;
		ИначеЕсли Материал = "Компонент 3" Тогда
			Компонент = 3;
		ИначеЕсли Материал = "Компонент 4" Тогда 
			Компонент = 4;
		КонецЕсли;	

		// Считает только килограммы
		Если СтрокаТабличнойЧасти.ЕдиницаИзмеренияЗагрузки = "кг" Тогда
			//  Основа счет загрузки
			Если Компонент = 1 Тогда
				Объект.Загрузка1 = Объект.Загрузка1 + СтрокаТабличнойЧасти.КоличествоНаТонну;   
			// Компонент 2 счет загрузки
			ИначеЕсли Компонент = 2 Тогда  
				Объект.Загрузка2 = Объект.Загрузка2 + СтрокаТабличнойЧасти.КоличествоНаТонну; 
			// Компонент 3 счет загрузки
			ИначеЕсли Компонент = 3 Тогда 
				Объект.Загрузка3 = Объект.Загрузка3 + СтрокаТабличнойЧасти.КоличествоНаТонну;
			// Компонент 4 счет загрузки	
			Иначе 
				Объект.Загрузка4 = Объект.Загрузка4 + СтрокаТабличнойЧасти.КоличествоНаТонну;	
			КонецЕсли;
		КонецЕсли;
		
		КонецЦикла;           
		
		// Считает стоимость производства
		Объект.ОбщаяСтоимостьПроизводства = Объект.Состав.Итог("Сумма") + Объект.Переработка; 
		Объект.Компонент2 = Объект.Загрузка2;
		Объект.Компонент3 = Объект.Загрузка3;
		Объект.Компонент4 = Объект.Загрузка4;
		Объект.КомпонентСумма = Объект.Компонент1 + Объект.Компонент2 + Объект.Компонент3 + Объект.Компонент4;
		Объект.ЦенаЗаКг = Объект.ОбщаяСтоимостьПроизводства / Объект.КомпонентСумма;  
		Объект.ЗагрузкаИтого = Объект.Загрузка1 + Объект.Загрузка2 + Объект.Загрузка3 + Объект.Загрузка4;
КонецПроцедуры

