
&НаКлиенте
Процедура ВыполнитьЗагрузку(Команда)
	
	Путь = Объект.ФайлЗагрузки;

    Если Путь = "" Тогда
        Сообщить("Укажите путь к файлу Excel.");
        Возврат;
    КонецЕсли;
    
    Попытка
        // Очищаем существующую таблицу значений
        Реквизит1.Очистить();
        
        // Подключаем Excel
        ExcelApp = Новый COMОбъект("Excel.Application");
        ExcelApp.Visible = Ложь;
        Книга = ExcelApp.Workbooks.Open(Путь);
        Лист = Книга.Worksheets(1);
        
        Строк = Лист.UsedRange.Rows.Count;
        
        Для i = 2 По Строк Цикл // первая строка - заголовки
            НоваяСтрока =         Реквизит1.Добавить();
            
            НоваяСтрока.Номенклатура = Лист.Cells(i,1).Value;
            НоваяСтрока.Цвет = Лист.Cells(i,3).Value;
            НоваяСтрока.ral = Лист.Cells(i,4).Value;
            НоваяСтрока.Фасовка = Лист.Cells(i,5).Value;
            НоваяСтрока.Партия = Лист.Cells(i,7).Value;
            НоваяСтрока.Комплект = Лист.Cells(i,2).Value;
            НоваяСтрока.брак = Лист.Cells(i,8).Value;
            НоваяСтрока.ВходнойКонтроль = Лист.Cells(i,6).Value;
            НоваяСтрока.МестоХранения = Лист.Cells(i,10).Value;
            НоваяСтрока.Количество = Лист.Cells(i,9).Value;
            НоваяСтрока.Цена = Лист.Cells(i,11).Value;
            НоваяСтрока.Ответственный = Лист.Cells(i,12).Value;
            
        КонецЦикла;
        
        Книга.Close(Ложь);
        ExcelApp.Quit();
        Книга = Неопределено;
		Лист = Неопределено;
		ExcelApp = Неопределено;
        
        Сообщить("Данные успешно загружены.");
        
    Исключение
        Сообщить("Ошибка при загрузке Excel: " + ОписаниеОшибки());
    КонецПопытки;

КонецПроцедуры
