
&НаКлиенте
Процедура ОтобратьДокументы(Команда)
	ОтобратьДокументыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтобратьДокументыНаСервере()  
	
    Логин                   = "ВыгрузкаИзБП";   //ЭтаФорма.ЛогинВБП;
    Пароль                  = "gpDcO4N30TVyz4ixHeML";           //ЭтаФорма.ПарольВБП;
    КластерСерверов         = "192.168.1.100";
    ИмяИнформационнойБазы	= "acc";  
    
    Попытка
    	дб 		= Новый COMОбъект("V83.ComConnector");  
    	база 	= дб.Connect("Srvr="""+КластерСерверов+""";Ref="""+ИмяИнформационнойБазы+""";Usr="""+Логин+""";Pwd="""+Пароль+""";");
    	//Сообщить("Успех!");
    Исключение
    	Сообщить("Нет соединения");
    КонецПопытки; 
	
	ПоступлениеБП = база.Документы.СчетНаОплатуПокупателю.Выбрать(НачалоДня(Объект.НачалоПериода), КонецДня(Объект.КонецПериода));
	
	ТЗДок.Очистить();
	Пока ПоступлениеБП.Следующий() Цикл	
			Если НЕ ПоступлениеБП.DeletionMark Тогда 
				нд 					= ТЗДок.Добавить();
				нд.Выбран 			= Ложь;
				нд.Номер			= ПоступлениеБП.Номер;
				нд.Дата 			= ПоступлениеБП.Дата;
				нд.Контрагент 		= база.XMLСтрока(ПоступлениеБП.Контрагент.Наименование); 
				//	нд.Ответственный	= ПоступлениеБП.Ответственный;
				нд.Ссылка			= Документы.РасходнаяНакладная.НайтиПоНомеру(ПоступлениеБП.Номер, ПоступлениеБП.Дата);
		        Если  ЗначениеЗаполнено(ПоступлениеБП.Контрагент.ИНН) Тогда
					нд.ИНН 			= база.XMLСтрока(ПоступлениеБП.Контрагент.ИНН);
				Иначе
					нд.ИНН 			= база.XMLСтрока(ПоступлениеБП.Контрагент.НалоговыйНомер); 
				КонецЕсли;
			КонецЕсли;
	КонецЦикла;	

 КонецПроцедуры

&НаКлиенте
 Процедура ЗагрузитьВБазу(Команда)
	 ЗагрузитьВБазуНаСервере();
 КонецПроцедуры

&НаСервере
 Процедура ЗагрузитьВБазуНаСервере()
	 
    Логин                   = "ВыгрузкаИзБП";
    Пароль                  = "gpDcO4N30TVyz4ixHeML";
    КластерСерверов         = "192.168.1.100";
    ИмяИнформационнойБазы	= "acc";  
    
    Попытка
    	дб 		= Новый COMОбъект("V83.ComConnector");  
    	база 	= дб.Connect("Srvr="""+КластерСерверов+""";Ref="""+ИмяИнформационнойБазы+""";Usr="""+Логин+""";Pwd="""+Пароль+""";");
    Исключение
    	Сообщить("Нет соединения");
    КонецПопытки; 

	
	Для Каждого строка из ТЗДок Цикл 
		Если строка.Выбран Или строка.Резерв Тогда
			ДокБП = база.Документы.СчетНаОплатуПокупателю.НайтиПоНомеру(строка.Номер, строка.Дата);
			Если ЗначениеЗаполнено(строка.Ссылка) Тогда
				Сообщить("Пропущен "+ строка.Номер);
			Иначе 
				строка.Ссылка = РаботаСоСправочниками.СоздатьДокументРеализации(ДокБП, строка.Резерв);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

 КонецПроцедуры

&НаКлиенте
 Процедура ТЗДокВыбранПриИзменении(Элемент)
	 СтрокаТабличнойЧасти = Элементы.ТЗДок.ТекущиеДанные;
	 СтрокаТабличнойЧасти.Резерв = Ложь;
 КонецПроцедуры

&НаКлиенте
 Процедура ТЗДокРезервПриИзменении(Элемент)
	 СтрокаТабличнойЧасти = Элементы.ТЗДок.ТекущиеДанные;
	 СтрокаТабличнойЧасти.Выбран = Ложь;
 КонецПроцедуры
