
&НаКлиенте
Процедура РезультатПриАктивизации(Элемент)
	Сумма = 0;
	count = 0;
	average = 0;
	
	Для Каждого Область Из Результат.ВыделенныеОбласти Цикл
	   Если ТипЗнч(Область) = Тип("ОбластьЯчеекТабличногоДокумента") Тогда
	     Для ИндексСтрока = Область.Верх По Область.Низ Цикл
	        Для ИндексКолонка = Область.Лево По Область.Право Цикл
	          Попытка
	               vNumber = Число(СтрЗаменить(Результат.Область("R" + Формат(ИндексСтрока, "ЧГ=0") + "C" + Формат(ИндексКолонка, "ЧГ=0")) .Текст, " ", ""));
	Сумма = Сумма + vNumber;
	count = count + 1;
	          Исключение
	          КонецПопытки;
	        КонецЦикла;
	     КонецЦикла;
	  КонецЕсли;
	КонецЦикла; 

	Если count <> 0 Тогда
	   average = Сумма / count;
	Иначе
	average = 0;
	КонецЕсли;


	ЭтаФорма.Сумма = Сумма; 
	ЭтаФорма.Среднее = average;
	ЭтаФорма.КоличествоВыделенныхЭлементов = count;

КонецПроцедуры
