#Область СлужебныеПроцедурыИФункции

Функция РассчетНДС(СуммаБезНДС, СтавкаНДС)  Экспорт
	
	СуммаНДС = 0;
	Если СтавкаНДС = Перечисления.СтавкаНДС.НДС5 Тогда
		СуммаНДС = СуммаБезНДС * 10 / 105;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкаНДС.НДС10 Тогда
		СуммаНДС = СуммаБезНДС * 10 / 110;		
	ИначеЕсли СтавкаНДС = Перечисления.СтавкаНДС.НДС18 Тогда
		СуммаНДС = СуммаБезНДС * 18 / 118;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкаНДС.НДС20 Тогда
		СуммаНДС = СуммаБезНДС * 20 / 120;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкаНДС.НДС22 Тогда
		СуммаНДС = СуммаБезНДС * 20 / 122;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкаНДС.БезНДС Тогда
		СуммаНДС = 0;
	КонецЕсли;
	
	Возврат СуммаНДС;
КонецФункции

#КонецОбласти