Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	// Отключаем типовую логику (которая берет только Наименование)
    СтандартнаяОбработка = Ложь;
    
    // Указываем платформе, какие поля из БД нужно получить для формирования строки
    Поля.Добавить("Наименование");
    Поля.Добавить("Владелец");
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)

СтандартнаяОбработка = Ложь;
    
    // Получаем наименование характеристики (защита от пустых значений)
    ИмяХарактеристики = ?(ЗначениеЗаполнено(Данные.Наименование), Данные.Наименование, "<Без наименования>");
    
    // Получаем строковое представление владельца (Номенклатуры)
    ИмяВладельца = ?(ЗначениеЗаполнено(Данные.Владелец), Строка(Данные.Владелец), "<Без номенклатуры>");
    
    // Формируем итоговую строку. Например: "Красный, размер 42 [Футболка Поло]"
    Представление = ИмяВладельца + " " + ИмяХарактеристики;
    
КонецПроцедуры