
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.Рецептуры.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Рецептуры.Дата,
	|	Рецептуры.Наименование,
	|	Рецептуры.Номер,
	|	Рецептуры.Примечание,
	|	Рецептуры.ТребуемоеКоличество,
	|	Рецептуры.ЦенаЗаКг,
	|	Рецептуры.РецептураСостав.(
	|		НомерСтроки,
	|		Материал,
	|		КоличествоНаТонну,
	|		ТребуетсяДляПроизводства,
	|		Тара,
	|		ТараДляПроизводства,
	|		Сумма
	|	)
	|ИЗ
	|	Документ.Рецептуры КАК Рецептуры
	|ГДЕ
	|	Рецептуры.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьРецептураСоставШапка = Макет.ПолучитьОбласть("РецептураСоставШапка");
	ОбластьРецептураСостав = Макет.ПолучитьОбласть("РецептураСостав");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьРецептураСоставШапка);
		ВыборкаРецептураСостав = Выборка.РецептураСостав.Выбрать();
		Пока ВыборкаРецептураСостав.Следующий() Цикл   
			
	 //Выделаю красным строку - разделитель у которой сумма равна 0
	 // Исправить - 1)Поиск по наименованию
				Если 
					
					ВыборкаРецептураСостав.Сумма = 0 Тогда 
				
					ОбластьРецептураСостав.Область(1, 2, 1, 6).ЦветФона = WebЦвета.Коралловый;
					
				Иначе
					
					ОбластьРецептураСостав.Область(1, 2, 1, 6).ЦветФона = WebЦвета.Белый;
					
				КонецЕсли;
				
			ОбластьРецептураСостав.Параметры.Заполнить(ВыборкаРецептураСостав);
			ТабДок.Вывести(ОбластьРецептураСостав, ВыборкаРецептураСостав.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
