

Процедура ОбработкаПроведения(Отказ, Режим)   
	Если ЭтотОбъект.ТребуемоеКоличество <= 0 Тогда
		
		Сообщить("Нельзя произвести " + ЭтотОбъект.ТребуемоеКоличество + " кг");
		Отказ = Истина;
		
	КонецЕсли;

	Движения.ПотребностьМатериалов.Записывать = Истина;
	Движения.СтатусПродукции.Записывать = Истина;
	
	Для Каждого ТекСтрокаРецептураСостав Из РецептураСостав Цикл
		
		Если НЕ ТекСтрокаРецептураСостав.ЕдиницаИзмеренияЗагрузки = "-" Тогда
			Движение = Движения.ПотребностьМатериалов.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Наименование = ТекСтрокаРецептураСостав.Материал;
			Движение.Потребность = ТекСтрокаРецептураСостав.Потребность;
		КонецЕсли;
		
		ТекСтрокаРецептураСостав.ВПроизводстве = РаботаСоСправочниками.ВПроизводствеОстаток(ЭтотОбъект.Ссылка, ТекСтрокаРецептураСостав.Материал);
			
		Если ТекСтрокаРецептураСостав.Действие = ПредопределенноеЗначение("Перечисление.СостояниеОбеспечения.Отгрузить") И ТекСтрокаРецептураСостав.ВПроизводстве >= ТекСтрокаРецептураСостав.ТребуетсяДляПроизводства Тогда
			
			ТекСтрокаРецептураСостав.Действие = ПредопределенноеЗначение("Перечисление.СостояниеОбеспечения.Отгружен");
			
		КонецЕсли;	

	КонецЦикла; 
	
	Для Каждого ТекСтрокаПродукция Из Продукция Цикл
		  Движение = Движения.СтатусПродукции.Добавить();
		  Движение.Период = Дата;
		  Движение.Номенклатура = ТекСтрокаПродукция.Наименование;
		  Движение.Статус = ТекСтрокаПродукция.СостояниеОбеспечения;
	КонецЦикла;
	
			
КонецПроцедуры


Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Рецепт") Тогда
		// Заполнение шапки
		Наименование = ДанныеЗаполнения.Наименование;
		Переработка = ДанныеЗаполнения.Переработка;
		Примечание = ДанныеЗаполнения.Примечание;
		Для Каждого ТекСтрокаСостав Из ДанныеЗаполнения.Состав Цикл
			Если ТекСтрокаСостав.КоличествоНаТонну > 0 ИЛИ ТекСтрокаСостав.ЕдиницаИзмеренияЗагрузки = "-" Тогда
				НоваяСтрока = РецептураСостав.Добавить();
				НоваяСтрока.КоличествоНаТонну = ТекСтрокаСостав.КоличествоНаТонну;
				НоваяСтрока.Материал = ТекСтрокаСостав.Материал;   
				НоваяСтрока.ТребуетсяДляПроизводства = ТекСтрокаСостав.КоличествоНаТонну;
				НоваяСтрока.Действие = Перечисления.СостояниеОбеспечения.КОбеспечению;
				НоваяСтрока.ИзРецептуры = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

