
Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.ОстаткиМатериалов.Записывать = Истина;
	Для Каждого ТекСтрокаМатериалы Из Материалы Цикл
		Движение = Движения.ОстаткиМатериалов. Добавить();
		
		Если ТекСтрокаМатериалы.Коррекция > 0 Тогда
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Остаток = ТекСтрокаМатериалы.Коррекция;
		Иначе
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход; 
			Движение.Остаток = - ТекСтрокаМатериалы.Коррекция;
		КонецЕсли;
		
		Движение.Период = Дата;
		Движение.Наименование = ТекСтрокаМатериалы.Номенклатура;
	КонецЦикла;

	
КонецПроцедуры
