
Процедура ОбработкаПроведения(Отказ, Режим) 
	
	Движения.ПотребностьМатериалов.Записывать = Истина;
 	Движения.СтатусПродукции.Записывать = Истина;
	Движения.СведенияВПродукцииИзСчетов.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл  
			
		// регистр ПотребностьМатериалов 
		Движение = Движения.ПотребностьМатериалов.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Наименование = ТекСтрокаТовары.Номенклатура;
		Движение.Потребность = ТекСтрокаТовары.Количество;     
	 
		Движение = Движения.СтатусПродукции.Добавить();
		Движение.Период = ТекущаяДата();
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Статус = ТекСтрокаТовары.Действие;  
		
		Движение = Движения.СведенияВПродукцииИзСчетов.Добавить();
		Движение.Период = ТекущаяДата(); 
		Движение.НомерСчета = Номер;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Количество = ТекСтрокаТовары.Количество; 
		Движение.Цена = ТекСтрокаТовары.ЦенаПродажи;

	КонецЦикла;

КонецПроцедуры
