Процедура ОбработкаПроведения(Отказ, Режим) 
   
	// 1. Подготавливаем движения
	Движения.ОстаткиМатериалов.Записывать = Истина;
	Движения.ЗаказыРезервы.Записывать = Истина;
    
    // 2. Очищаем старые движения (если документ перепроводится)
    Движения.ЗаказыРезервы.Очистить();
    
    // 3. Формируем движения по каждой строке табличной части
	Для Каждого ТекСтрока Из Товары Цикл

		НужноеКоличество = ТекСтрока.Количество;		
        
        Если НужноеКоличество <= 0 Тогда
            Продолжить; // Пропускаем пустые строки
        КонецЕсли;
  
		// 4. Ищем свободный остаток на складе (Счет = ПустаяСсылка)      
		СвободныйОстаток = РегистрыНакопления.ОстаткиМатериалов.Остатки(
            Новый Структура("Наименование, Счет", ТекСтрока.Номенклатура, Документы.РасходнаяНакладная.ПустаяСсылка())
        );
        
 		КоличествоИзНаличия = Мин(НужноеКоличество, СвободныйОстаток);       
 		НужноеКоличествоКоличествоВПроизводство = НужноеКоличество - КоличествоИзНаличия;
 		
		// 5. Бронируем то, что нашли на складе       
		Если КоличествоИзНаличия > 0 Тогда
            // Убираем из свободного остатка
            Дв = Движения.ОстаткиМатериалов.ДобавитьРасход();
            Дв.Наименование = ТекСтрока.Номенклатура;
            Дв.Счет = Документы.РасходнаяНакладная.ПустаяСсылка();
            Дв.Остаток = КоличествоИзНаличия;
            
            // Перекладываем в резерв под этот счет
            Дв = Движения.ОстаткиМатериалов.ДобавитьПриход();
            Дв.Наименование = ТекСтрока.Номенклатура;
            Дв.Счет = Ссылка;
            Дв.Остаток = КоличествоИзНаличия;
        КонецЕсли;		

		// 4. Отправляем дефицит в очередь производства
        Если НужноеКоличествоКоличествоВПроизводство > 0 Тогда
            Дв = Движения.ЗаказыРезервы.ДобавитьПриход();
            Дв.Период 				= Дата;
            Дв.Счет 				= Ссылка;
            Дв.Номенклатура 		= ТекСтрока.Номенклатура;
          	Дв.Цвет         		= ТекСтрока.Цвет;
        	Дв.RAL          		= ТекСтрока.RAL;
        	Дв.Фасовка     		= ТекСтрока.Фасовка;
        	Дв.ВходнойКонтроль 	= ТекСтрока.ВходнойКонтроль;          
			// Фиксируем плановое количество            
            Дв.Количество = НужноеКоличествоКоличествоВПроизводство;
            // ... RAL, Цвет и т.д.
        КонецЕсли;		
     
	КонецЦикла;

КонецПроцедуры