
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	Если ТекущийОбъект.Проведен Тогда
		ЭтаФорма.ТолькоПросмотр = Истина;		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура МатериалыЦенаПриИзменении(Элемент)

	СтрокаТабличнойЧасти = Элементы.Материалы.ТекущиеДанные;
	Если СтрокаТабличнойЧасти.Количество + РаботаСоСправочниками.ОстаткиМатериалов(СтрокаТабличнойЧасти.Номенклатура) > 0 Тогда
		СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.Цена;
		СтрокаТабличнойЧасти.СредняяЦена = (СтрокаТабличнойЧасти.Сумма + РаботаСоСправочниками.ЦенаМатериалов(ТекущаяДата(), СтрокаТабличнойЧасти.Номенклатура) * РаботаСоСправочниками.ОстаткиМатериалов(СтрокаТабличнойЧасти.Номенклатура)) / (СтрокаТабличнойЧасти.Количество + РаботаСоСправочниками.ОстаткиМатериалов(СтрокаТабличнойЧасти.Номенклатура));
		Объект.Сумма = Объект.Материалы.Итог("Сумма");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МатериалыКоличествоПриИзменении(Элемент)
		
	СтрокаТабличнойЧасти = Элементы.Материалы.ТекущиеДанные;
	Если СтрокаТабличнойЧасти.Количество + РаботаСоСправочниками.ОстаткиМатериалов(СтрокаТабличнойЧасти.Номенклатура) > 0 Тогда
		СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.Цена;
		СтрокаТабличнойЧасти.СредняяЦена = (СтрокаТабличнойЧасти.Сумма + РаботаСоСправочниками.ЦенаМатериалов(ТекущаяДата(), СтрокаТабличнойЧасти.Номенклатура) * РаботаСоСправочниками.ОстаткиМатериалов(СтрокаТабличнойЧасти.Номенклатура)) / (СтрокаТабличнойЧасти.Количество + РаботаСоСправочниками.ОстаткиМатериалов(СтрокаТабличнойЧасти.Номенклатура));
		Объект.Сумма = Объект.Материалы.Итог("Сумма");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура МатериалыСуммаПриИзменении(Элемент)
		
	СтрокаТабличнойЧасти = Элементы.Материалы.ТекущиеДанные;
	Если СтрокаТабличнойЧасти.Количество > 0 Тогда
		 СтрокаТабличнойЧасти.Цена = СтрокаТабличнойЧасти.Сумма / СтрокаТабличнойЧасти.Количество;
		 СтрокаТабличнойЧасти.СредняяЦена = (СтрокаТабличнойЧасти.Сумма + РаботаСоСправочниками.ЦенаМатериалов(ТекущаяДата(), СтрокаТабличнойЧасти.Номенклатура) * РаботаСоСправочниками.ОстаткиМатериалов(СтрокаТабличнойЧасти.Номенклатура)) / (СтрокаТабличнойЧасти.Количество + РаботаСоСправочниками.ОстаткиМатериалов(СтрокаТабличнойЧасти.Номенклатура));
		 Объект.Сумма = Объект.Материалы.Итог("Сумма");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура МатериалыНоменклатураПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.Материалы.ТекущиеДанные;
	СтрокаТабличнойЧасти.Цена = РаботаСоСправочниками.ЦенаПокупки(СтрокаТабличнойЧасти.Номенклатура);
КонецПроцедуры

