
&НаКлиенте
Процедура Прочитать(Команда)
	ТаблицаДанных.Очистить();
	ПрочитатьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПрочитатьНаСервере()
	Построитель = Новый ПостроительЗапроса;
	Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(Таблица.Область());
	Построитель.ЗаполнитьНастройки();
	Построитель.Выполнить();
	Таб = Построитель.Результат.Выгрузить();
	
	Запрос = Новый Запрос;   
	Запрос.УстановитьПараметр("мДанные", Таб);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	мДанные.Компоненты КАК Компоненты,
		|	мДанные.Количество КАК Количество
		|ПОМЕСТИТЬ ВТ_Данные
		|ИЗ
		|	&мДанные КАК мДанные
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Данные.Компоненты КАК Компоненты,
		|	ВТ_Данные.Количество КАК Количество,
		|	НоменклатураМатериалы.Ссылка КАК Номенклатура
		|ИЗ
		|	ВТ_Данные КАК ВТ_Данные
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НоменклатураМатериалы КАК НоменклатураМатериалы
		|		ПО ВТ_Данные.Компоненты = НоменклатураМатериалы.Код";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Количество) Тогда
			Если НЕ ВыборкаДетальныеЗаписи.Компоненты = "Переработка" Тогда  
				нд = ТаблицаДанных.Добавить();
				нд.Компоненты = ВыборкаДетальныеЗаписи.Компоненты;
				нд.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
				нд.Количество = ВыборкаДетальныеЗаписи.Количество;           
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	Заполненно = Истина;
	
	СтрокаТабличнойЧасти = Элементы.ТаблицаДанных.ТекущиеДанные;
	Для Каждого СтрокаТабличнойЧасти Из ТаблицаДанных Цикл 
		Если НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.Номенклатура) Тогда
			Заполненно = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Если Заполненно Тогда
		ОповеститьОВыборе(ТаблицаДанных);
	Иначе Сообщить("Не вся номенклатура заполнена.");
	КонецЕсли;
	
КонецПроцедуры
