
Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.ЦеныМатериалов.Записывать = Истина;
	Движения.ОстаткиМатериалов.Записывать = Истина;
	Движения.СтоимостьМатериалов.Записывать = Истина; 
 	Движения.СтатусПродукции.Записывать = Истина;
 	
	// 1. Инициализация набора записей регистра сведений
    НаборХарактеристикПартий = РегистрыСведений.ХарактеристикиПартий.СоздатьНаборЗаписей();
	// Устанавливаем отбор по текущему документу. 
    // Это гарантирует, что при перепроведении старые записи этой партии очистятся.
    НаборХарактеристикПартий.Отбор.Партия.Установить(Ссылка);

	Для Каждого ТекСтрокаПродукция Из Продукция Цикл
		Движение = Движения.ЦеныМатериалов.Добавить();
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаПродукция.НаменованиеПродукции;
		Движение.Цена = ТекСтрокаПродукция.Цена;

		Движение = Движения.ОстаткиМатериалов.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Наименование = ТекСтрокаПродукция.НаменованиеПродукции;
		Движение.Остаток = ТекСтрокаПродукция.Количество;   
		
		// регистр СтоимостьМатериалов Приход	
		Движение = Движения.СтоимостьМатериалов.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Материал = ТекСтрокаПродукция.НаменованиеПродукции;
		Движение.Стоимость = ТекСтрокаПродукция.Количество * ТекСтрокаПродукция.Цена;    
		
 		Движение = Движения.СтатусПродукции.Добавить();
		Движение.Период = ТекущаяДата();
		Движение.Номенклатура = ТекСтрокаПродукция.НаменованиеПродукции;
		Движение.Статус = ТекСтрокаПродукция.СостояниеОбеспечения; 
		
		// Добавляем новую запись в набор
        НоваяЗаписьХарактеристикиПартий 				= НаборХарактеристикПартий.Добавить();
        // Заполняем Измерения
        НоваяЗаписьХарактеристикиПартий.Партия 			= Ссылка;
        НоваяЗаписьХарактеристикиПартий.Номенклатура 	= ТекСтрокаПродукция.НаменованиеПродукции;
        // Заполняем Ресурсы
        НоваяЗаписьХарактеристикиПартий.Цвет 			= ТекСтрокаПродукция.Цвет;
        НоваяЗаписьХарактеристикиПартий.RAL 			= ТекСтрокаПродукция.RAL;
        НоваяЗаписьХарактеристикиПартий.Фасовка 		= ТекСтрокаПродукция.Фасовка;
        НоваяЗаписьХарактеристикиПартий.Вязкость 		= ТекСтрокаПродукция.Вязкость;
        НоваяЗаписьХарактеристикиПартий.Перетир 		= ТекСтрокаПродукция.Перетир;
        НоваяЗаписьХарактеристикиПартий.ВходнойКонтроль = ТекСтрокаПродукция.ВходнойКонтроль;
	КонецЦикла;
	// 3. Запись набора в базу данных (Истина = с замещением существующих)
    НаборХарактеристикПартий.Записать(Истина);
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Рецептуры") Тогда
		НомерДокументаОснования = ДанныеЗаполнения.Наименование;
		Примечание = ДанныеЗаполнения.Примечание;
		ДокументОснование = ДанныеЗаполнения.Ссылка;
		Номер = ДанныеЗаполнения.Номер;
		Для Каждого ТекСтрокаПродукция Из ДанныеЗаполнения.Продукция Цикл  
			Если ТекСтрокаПродукция.СостояниеОбеспечения = Перечисления.СтатусыГотовностиПродукции.ВРаботе Тогда
				НоваяСтрока = Продукция.Добавить();
				НоваяСтрока.Количество = ТекСтрокаПродукция.Количество;
				НоваяСтрока.НаменованиеПродукции = ТекСтрокаПродукция.Наименование;
				НоваяСтрока.СостояниеОбеспечения = Перечисления.СтатусыГотовностиПродукции.ГотовКОтгрузке;
				НоваяСтрока.Цена = ТекСтрокаПродукция.Цена;
			КонецЕсли;	
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
