
Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.ОстаткиМатериалов.Записывать 				= Истина;
	Движения.ОстаткиМатериалов.БлокироватьДляИзменения 	= Истина;
	
	Движения.ЦеныМатериалов.Записывать 					= Истина;	
	Движения.СтоимостьМатериалов.Записывать 			= Истина; 
 	Движения.СтатусПродукции.Записывать 				= Истина;
 	
 	ВыпускПодЗаказ = ЗначениеЗаполнено(ЗаказКлиента);
 	
 	Если ВыпускПодЗаказ Тогда
		Движения.ЗаказыРезервы.Записывать = Истина;
		Движения.ЗаказыРезервы.БлокироватьДляИзменения = Истина;
 	КонецЕсли;	
 	
 	// 1. Инициализация набора записей регистра сведений
    НаборХарактеристикПартий = РегистрыСведений.ХарактеристикиПартий.СоздатьНаборЗаписей();
	// Устанавливаем отбор по текущему документу. 
    // Это гарантирует, что при перепроведении старые записи этой партии очистятся.
    НаборХарактеристикПартий.Отбор.Партия.Установить(Ссылка);
 	
 	// 1. Формируем движения
	Для Каждого ТекСтрока Из Продукция Цикл
		
		// Оприходование реального товара на склад
		ДвижениеОстатки 				= Движения.ОстаткиМатериалов.Добавить();
		ДвижениеОстатки.ВидДвижения 	= ВидДвиженияНакопления.Приход;
		ДвижениеОстатки.Период 			= Дата;
		ДвижениеОстатки.Наименование 	= ТекСтрока.Номенклатура;
		ДвижениеОстатки.Характеристики 	= ТекСтрока.Характеристика;
		ДвижениеОстатки.Партия 			= Ссылка;
		ДвижениеОстатки.Остаток 		= ТекСтрока.Количество;
		ДвижениеОстатки.Сумма			= ТекСтрока.Сумма;
		
		// Автоматическая переброска резерва (Трансформация)
		Если ВыпускПодЗаказ Тогда
			
			// ШАГ А: Снимаем резерв с "пустой" партии
			ДвижениеРасход 					= Движения.ЗаказыРезервы.Добавить();
			ДвижениеРасход.ВидДвижения 		= ВидДвиженияНакопления.Расход;
			ДвижениеРасход.Период 			= Дата;
			ДвижениеРасход.Счет 			= ЗаказКлиента;
			ДвижениеРасход.Номенклатура 	= ТекСтрока.Номенклатура;
			ДвижениеРасход.Характеристика 	= ТекСтрока.Характеристика;
			ДвижениеРасход.Партия 			= Справочники.Партии.ПустаяСсылка(); // Убираем пустышку
			ДвижениеРасход.Количество 		= ТекСтрока.Количество;
			
			// ШАГ Б: Ставим в резерв ту же номенклатуру, но уже на РЕАЛЬНУЮ партию
			ДвижениеПриход 					= Движения.ЗаказыИРезервы.Добавить();
			ДвижениеПриход.ВидДвижения 		= ВидДвиженияНакопления.Приход;
			ДвижениеПриход.Период 			= Дата;
			ДвижениеПриход.Счет		 		= ЗаказКлиента;
			ДвижениеПриход.Номенклатура 	= ТекСтрока.Номенклатура;
			ДвижениеПриход.Характеристика 	= ТекСтрока.Характеристика;
			ДвижениеПриход.Партия 			= Ссылка;
			ДвижениеПриход.Количество 		= ТекСтрока.Количество;
			
		КонецЕсли;
		
		Движение 				= Движения.ЦеныМатериалов.Добавить();
		Движение.Период 		= Дата;
		Движение.Партия			= Ссылка;
		Движение.Номенклатура 	= ТекСтрока.Номенклатура;
		Движение.Характеристика = ТекСтрока.Характеристика;
		Движение.Цена 			= ТекСтрока.Цена;
		
		// Добавляем новую запись в набор
        НоваяЗаписьХарактеристикиПартий 							= НаборХарактеристикПартий.Добавить();
        // Заполняем Измерения
        НоваяЗаписьХарактеристикиПартий.Партия 						= Ссылка;
        НоваяЗаписьХарактеристикиПартий.Номенклатура 				= ТекСтрока.Номенклатура;
        // Заполняем Ресурсы
        НоваяЗаписьХарактеристикиПартий.ХарактеристикиНоменклатуры 	= ТекСтрока.Характеристики;
		НоваяЗаписьХарактеристикиПартий.Вязкость 					= ТекСтрока.Вязкость;
        НоваяЗаписьХарактеристикиПартий.Перетир 					= ТекСтрока.Перетир;
		НоваяЗаписьХарактеристикиПартий.Примечание					= ТекСтрока.Примечание;
		НоваяЗаписьХарактеристикиПартий.Брак						= Брак;
		
	КонецЦикла;	
 	
 	// Записываем движения
	Движения.Записать();
	
	// Контроль: проверяем, не перерасходовали ли мы виртуальный резерв заказа
	// (например, если выпустили больше, чем изначально планировалось в заказе)
	Если Режим = РежимПроведенияДокумента.Оперативный И ВыпускПодЗаказ Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Резервы.Номенклатура.Наименование КАК Товар,
			|	-Резервы.КоличествоОстаток КАК Дефицит
			|ИЗ
			|	РегистрНакопления.ЗаказыРезервы.Остатки(&ГраницаКонтроля, Счет = &ЗаказКлиента) КАК Резервы
			|ГДЕ
			|	Резервы.КоличествоОстаток < 0";
			
		Запрос.УстановитьПараметр("ЗаказКлиента", ЗаказКлиента);
		Запрос.УстановитьПараметр("ГраницаКонтроля", Новый Граница(МоментВремени(), ВидГраницы.Включая));
		
		Результат = Запрос.Выполнить();
		Если Не Результат.Пустой() Тогда
			Отказ = Истина;
			Выборка = Результат.Выбрать();
			Пока Выборка.Следующий() Цикл
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Объем выпуска превышает заказ! Номенклатура: " + Выборка.Товар + ". Излишек: " + Выборка.Дефицит;
				Сообщение.Сообщить();
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
 	
	// 3. Запись набора в базу данных (Истина = с замещением существующих)
    НаборХарактеристикПартий.Записать(Истина);
    
    
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Рецептуры") Тогда
		НомерДокументаОснования = ДанныеЗаполнения.Наименование;
		Примечание = ДанныеЗаполнения.Примечание;
		ДокументОснование = ДанныеЗаполнения.Ссылка;
		Номер = ДанныеЗаполнения.Номер;
		Для Каждого ТекСтрокаПродукция Из ДанныеЗаполнения.Продукция Цикл  
			Если ТекСтрокаПродукция.СостояниеОбеспечения = Перечисления.СтатусыГотовностиПродукции.ВРаботе Тогда
				НоваяСтрока = Продукция.Добавить();
				НоваяСтрока.Количество = ТекСтрокаПродукция.Количество;
				НоваяСтрока.НаменованиеПродукции = ТекСтрокаПродукция.Наименование;
				НоваяСтрока.СостояниеОбеспечения = Перечисления.СтатусыГотовностиПродукции.ГотовКОтгрузке;
				НоваяСтрока.Цена = ТекСтрокаПродукция.Цена;
			КонецЕсли;	
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
