
Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.ЦеныМатериалов.Записывать = Истина;
	Движения.ОстаткиМатериалов.Записывать = Истина;
	Движения.СтоимостьМатериалов.Записывать = Истина; 
 	Движения.СтатусПродукции.Записывать = Истина;

	Для Каждого ТекСтрокаПродукция Из Продукция Цикл
		Движение = Движения.ЦеныМатериалов.Добавить();
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаПродукция.НаменованиеПродукции;
		Движение.Цена = ТекСтрокаПродукция.Цена;

		Движение = Движения.ОстаткиМатериалов.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Наименование = ТекСтрокаПродукция.НаменованиеПродукции;
		Движение.Остаток = ТекСтрокаПродукция.Количество;   
		
		// регистр СтоимостьМатериалов Приход	
		Движение = Движения.СтоимостьМатериалов.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Материал = ТекСтрокаПродукция.НаменованиеПродукции;
		Движение.Стоимость = ТекСтрокаПродукция.Количество * ТекСтрокаПродукция.Цена;    
		
 		Движение = Движения.СтатусПродукции.Добавить();
		Движение.Период = ТекущаяДата();
		Движение.Номенклатура = ТекСтрокаПродукция.НаменованиеПродукции;
		Движение.Статус = ТекСтрокаПродукция.СостояниеОбеспечения; 
	КонецЦикла;

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Рецептуры") Тогда
		НомерДокументаОснования = ДанныеЗаполнения.Наименование;
		Примечание = ДанныеЗаполнения.Примечание;
		ДокументОснование = ДанныеЗаполнения.Ссылка;
		Для Каждого ТекСтрокаПродукция Из ДанныеЗаполнения.Продукция Цикл  
			Если ТекСтрокаПродукция.СостояниеОбеспечения = Перечисления.СтатусыГотовностиПродукции.ВРаботе Тогда
				НоваяСтрока = Продукция.Добавить();
				НоваяСтрока.Количество = ТекСтрокаПродукция.Количество;
				НоваяСтрока.НаменованиеПродукции = ТекСтрокаПродукция.Наименование;
				НоваяСтрока.СостояниеОбеспечения = Перечисления.СтатусыГотовностиПродукции.ГотовКОтгрузке;
				НоваяСтрока.Цена = ТекСтрокаПродукция.Цена;
			КонецЕсли;	
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
