&НаСервереБезКонтекста
Функция ПолучитьЕдИзмМатериала(НоменклатураМатериалы) 
// Функция передает в процедуру единицу измерения материала из справочника НоменклатураМатериалы

	Возврат НоменклатураМатериалы.ЕдиницаИзмеренияСырья; 
	                     	
КонецФункции

&НаКлиенте
Процедура ТабличнаяЧасть1ПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.ТабличнаяЧасть1.ТекущиеДанные;
	
	Для Каждого СтрокаТабличнойЧасти Из Объект.ТабличнаяЧасть1 Цикл
		
		 //Получает остаток из ркгистра
		СтрокаТабличнойЧасти.Остаток = РаботаСоСправочниками.ОстаткиМатериалов(СтрокаТабличнойЧасти.НаменованиеМатериала);
		СтрокаТабличнойЧасти.ЕдиницаИзмерения = ПолучитьЕдИзмМатериала(СтрокаТабличнойЧасти.НаменованиеМатериала);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("Документ.СпиасниеВПроизводство.Проведен", Объект.Ссылка, ЭтотОбъект);
КонецПроцедуры
