&НаКлиенте
Функция ПолучитьЗначениеПераметраКомпоновщикаНастроек(КомпоновщикНастроек, ИмяПараметра)
    ИДНастройки = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти(ИмяПараметра).ИдентификаторПользовательскойНастройки;
    Коллекция = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы;
    Возврат Коллекция.Найти(ИДНастройки).Значение;
КонецФункции 

&НаКлиенте
Процедура УстановитьЗначениеПараметраКомпоновщикаНастроек(КомпоновщикНастроекР, ИмяПараметра, Значение)
	ИДНастройкиПараметраР = КомпоновщикНастроекР.Настройки.ПараметрыДанных.Элементы.Найти(ИмяПараметра).ИдентификаторПользовательскойНастройки;
	КоллекцияР = КомпоновщикНастроекР.ПользовательскиеНастройки.Элементы;
	КоллекцияР.Найти(ИДНастройкиПараметраР).Значение = Значение;
КонецПроцедуры

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	
	СтандартнаяОбработка = Ложь;   
	
	РасшифрЗначение = ПолучитьРасшифровкуНаСервере(Расшифровка, "Наименование");
	
	ФормаР = ПолучитьФорму("Отчет.РасшифровкаОборотовНоменклатуры.Форма",,,РасшифрЗначение); 
	КомпоновщикНастроекР = ФормаР.Отчет.КомпоновщикНастроек;	
	
	ПериодОтчета = ПолучитьЗначениеПераметраКомпоновщикаНастроек(ЭтаФорма.Отчет.КомпоновщикНастроек, "Период");
	
	УстановитьЗначениеПараметраКомпоновщикаНастроек(КомпоновщикНастроекР, "Период", ПериодОтчета);
	
	Если РасшифрЗначение = Неопределено Тогда Возврат;
	ИначеЕсли ТипЗнч(РасшифрЗначение) = Тип("СправочникСсылка.НоменклатураМатериалы") Тогда
		Парам = Новый Структура();	
	    Парам.Вставить("СформироватьПриОткрытии", Истина);
	    Парам.Вставить("Отбор", Новый Структура("Наименование", РасшифрЗначение));
	    ОткрытьФорму("Отчет.РасшифровкаОборотовНоменклатуры.Форма.ФормаОтчета", Парам); 
	КонецЕсли;
	
 КонецПроцедуры         
 
&НаСервере
Функция ПолучитьРасшифровкуНаСервере(Расшифровка, ИмяПоля, ЭтоГруппа = Ложь)
	Данные = ПолучитьИзВременногоХранилища(ДанныеРасшифровки);
	Поля = Данные.Элементы.Получить(Расшифровка).ПолучитьПоля();
	
	НайденноеПоле = Поля.Найти(ИмяПоля);
	Если НайденноеПоле = Неопределено Тогда Возврат Неопределено;
	Иначе Возврат НайденноеПоле.Значение;
	КонецЕсли;
КонецФункции	


&НаКлиенте
Процедура РезультатПриАктивизации(Элемент)
	Сумма = 0;
	count = 0;
	average = 0;
	
	Для Каждого Область Из Результат.ВыделенныеОбласти Цикл
	   Если ТипЗнч(Область) = Тип("ОбластьЯчеекТабличногоДокумента") Тогда
	     Для ИндексСтрока = Область.Верх По Область.Низ Цикл
	        Для ИндексКолонка = Область.Лево По Область.Право Цикл
	          Попытка
	               vNumber = Число(СтрЗаменить(Результат.Область("R" + Формат(ИндексСтрока, "ЧГ=0") + "C" + Формат(ИндексКолонка, "ЧГ=0")) .Текст, " ", ""));
	Сумма = Сумма + vNumber;
	count = count + 1;
	          Исключение
	          КонецПопытки;
	        КонецЦикла;
	     КонецЦикла;
	  КонецЕсли;
	КонецЦикла; 

	Если count <> 0 Тогда
	   average = Сумма / count;
	Иначе
	average = 0;
	КонецЕсли;


	ЭтаФорма.Сумма = Сумма; 
	ЭтаФорма.Среднее = average;
	ЭтаФорма.КоличествоВыделенныхЭлементов = count;
КонецПроцедуры

