#Область ОбработчикиСобытийФормы
// Инициализирует форму подбора продукции и устанавливает флаг выбора для всех строк табличной части.
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы
// Уведомляет владельца формы о выборе продукта для переноса в документ.
//
// Параметры:
//   Команда - КомандаФормы - Команда, вызвавшая процедуру

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	ОповеститьОВыборе(Продукт);	
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Загружает в таблицу "Продукт" данные о номенклатуре и количестве из расходной накладной со статусом "Заявка".
//
//   Счет - ДокументСсылка.РасходнаяНакладная - Ссылка на документ, по которому выбираются данные
&НаСервере
Процедура ПриОткрытииНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасходнаяНакладнаяТовары.Номенклатура КАК Номенклатура,
		|	РасходнаяНакладнаяТовары.Количество КАК Количество
		|ИЗ
		|	Документ.РасходнаяНакладная.Товары КАК РасходнаяНакладнаяТовары
		|ГДЕ
		|	РасходнаяНакладнаяТовары.Ссылка = &Ссылка
		|	И РасходнаяНакладнаяТовары.Действие.Ссылка = &СтатусЗаявки";
	
	Запрос.УстановитьПараметр("Ссылка", Счет);
	Запрос.УстановитьПараметр("СтатусЗаявки", Перечисления.СтатусыГотовностиПродукции.Заявка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Продукт.Загрузить(РезультатЗапроса.Выгрузить());
	КонецЕсли;
	
	Для Каждого Строка Из Продукт Цикл
		Строка.Выбор = Истина;		
	КонецЦикла;
КонецПроцедуры
#КонецОбласти