#Область ОбработчикиСобытийФормы
// Инициализирует форму подбора продукции и устанавливает флаг выбора для всех строк табличной части.
//
// Параметры:
//   Отказ - Булево - Признак отмены открытия формы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
	
	СтрокаТабличнойЧасти = Элементы.Продукт.ТекущиеДанные;
	Для Каждого СтрокаТабличнойЧасти Из Продукт Цикл
		СтрокаТабличнойЧасти.Выбор = Истина;		
	КонецЦикла;   
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы
// Уведомляет владельца формы о выборе продукта для переноса в документ.
//
// Параметры:
//   Команда - КомандаФормы - Команда, вызвавшая процедуру

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	ОповеститьОВыборе(Продукт);	
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Загружает в таблицу "Продукт" данные о номенклатуре и количестве из расходной накладной со статусом "Заявка".
//
//   Счет - ДокументСсылка.РасходнаяНакладная - Ссылка на документ, по которому выбираются данные
&НаСервере
Процедура ПриОткрытииНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасходнаяНакладнаяТовары.Номенклатура КАК Номенклатура,
		|	РасходнаяНакладнаяТовары.Количество КАК Количество
		|ИЗ
		|	Документ.РасходнаяНакладная.Товары КАК РасходнаяНакладнаяТовары
		|ГДЕ
		|	РасходнаяНакладнаяТовары.Ссылка = &Ссылка И
		|   РасходнаяНакладнаяТовары.Действие.Ссылка = ЗНАЧЕНИЕ(Перечисление.СтатусыГотовностиПродукции.Заявка)";
	
	Запрос.УстановитьПараметр("Ссылка", Счет); 
	
	Продукт.Загрузить(Запрос.Выполнить().Выгрузить());
КонецПроцедуры
#КонецОбласти