
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Очищаем старые движения
	Движения.ЗаказыВПроизводстве.Записывать = Истина;
	Движения.ЗаказыВПроизводстве.Записать();
	
	// Взводим флаг для новой записи
	Движения.ЗаказыВПроизводстве.Записывать = Истина;
	
	// Фиксируем запуск номенклатуры в производство под конкретный заказ
	Движение 				= Движения.ЗаказыВПроизводстве.Добавить();
	Движение.ВидДвижения   	= ВидДвиженияНакопления.Приход;
	Движение.Период        	= Дата;
	//Движение.ЗаказКлиента  	= ЗаказКлиента;
	Движение.Номенклатура  	= Номенклатура;
	Движение.Характеристика = Характеристика;
	Движение.Количество    	= Количество; // Общий объем всего документа планирования
	
КонецПроцедуры
