
&НаКлиенте
Процедура ТипНоменклатурыПриИзменении(Элемент)
	Если Объект.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Сырье") Тогда 
		Элементы.МинимальныйОстаток.Видимость = Истина;
		Элементы.Фасовка.Видимость = Ложь;
		Элементы.Цвет.Видимость = Ложь;
		Элементы.RAL.Видимость = Ложь;
		Элементы.Номенклатура.Видимость = Ложь;   
		Элементы.МестоХранения.Видимость = Истина;
		Элементы.Вязкость.Видимость = Ложь;
		Элементы.Перетир.Видимость = Ложь;
		Объект.ЕдиницаИзмеренияСырья = ПредопределенноеЗначение("Перечисление.ЕдиницыИзмерения.Килограмм");
		Объект.Родитель =  ПредопределенноеЗначение("Справочник.НоменклатураМатериалы.Сырье");
				
	ИначеЕсли Объект.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Продукция") Тогда
		Элементы.МинимальныйОстаток.Видимость = Ложь;
		Элементы.Цвет.Видимость = Истина;
		Элементы.RAL.Видимость = Истина;  
		Элементы.Номенклатура.Видимость = Истина;
		Элементы.МестоХранения.Видимость = Истина;
		Элементы.Вязкость.Видимость = Истина;
		Элементы.Перетир.Видимость = Истина;
		Объект.ЕдиницаИзмеренияСырья = ПредопределенноеЗначение("Перечисление.ЕдиницыИзмерения.Килограмм");
		Объект.Родитель =  ПредопределенноеЗначение("Справочник.НоменклатураМатериалы.Продукция");
		
	ИначеЕсли Объект.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.УслугаРазделитель") Тогда
		Элементы.МинимальныйОстаток.Видимость = Ложь; 
		Элементы.Фасовка.Видимость = Ложь;
		Элементы.Цвет.Видимость = Ложь;
		Элементы.RAL.Видимость = Ложь; 
		Элементы.Номенклатура.Видимость = Ложь; 
		Элементы.МестоХранения.Видимость = Ложь;
		Элементы.Вязкость.Видимость = Ложь;
		Элементы.Перетир.Видимость = Ложь;
		Объект.ЕдиницаИзмеренияСырья = ПредопределенноеЗначение("Перечисление.ЕдиницыИзмерения.услуга"); 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Цвет) И ЗначениеЗаполнено(Объект.RAL) Тогда
		Объект.Наименование = Строка(Объект.Номенклатура) + " " + Строка(Объект.Цвет) + " RAL " + Строка(Объект.RAL) + " (" + Строка(Объект.Фасовка) + ")";
	ИначеЕсли ЗначениеЗаполнено(Объект.Цвет) И НЕ ЗначениеЗаполнено(Объект.RAL) Тогда
		Объект.Наименование = Строка(Объект.Номенклатура) + " " + Строка(Объект.Цвет) + " (" + Строка(Объект.Фасовка) + ") ";
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.Цвет) И НЕ ЗначениеЗаполнено(Объект.RAL) Тогда
		Объект.Наименование = Строка(Объект.Номенклатура) + " (" + Строка(Объект.Фасовка) + ") ";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ФасовкаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Цвет) И ЗначениеЗаполнено(Объект.RAL) Тогда
		Объект.Наименование = Строка(Объект.Номенклатура) + " " + Строка(Объект.Цвет) + " RAL " + Строка(Объект.RAL) + " (" + Строка(Объект.Фасовка) + ")";
	ИначеЕсли ЗначениеЗаполнено(Объект.Цвет) И НЕ ЗначениеЗаполнено(Объект.RAL) Тогда
		Объект.Наименование = Строка(Объект.Номенклатура) + " " + Строка(Объект.Цвет) + " (" + Строка(Объект.Фасовка) + ") ";
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.Цвет) И НЕ ЗначениеЗаполнено(Объект.RAL) Тогда
		Объект.Наименование = Строка(Объект.Номенклатура) + " (" + Строка(Объект.Фасовка) + ") ";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЦветПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Цвет) И ЗначениеЗаполнено(Объект.RAL) Тогда
		Объект.Наименование = Строка(Объект.Номенклатура) + " " + Строка(Объект.Цвет) + " RAL " + Строка(Объект.RAL) + " (" + Строка(Объект.Фасовка) + ")";
	ИначеЕсли ЗначениеЗаполнено(Объект.Цвет) И НЕ ЗначениеЗаполнено(Объект.RAL) Тогда
		Объект.Наименование = Строка(Объект.Номенклатура) + " " + Строка(Объект.Цвет) + " (" + Строка(Объект.Фасовка) + ") ";
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.Цвет) И НЕ ЗначениеЗаполнено(Объект.RAL) Тогда
		Объект.Наименование = Строка(Объект.Номенклатура) + " (" + Строка(Объект.Фасовка) + ") ";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура RALПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Цвет) И ЗначениеЗаполнено(Объект.RAL) Тогда
		Объект.Наименование = Строка(Объект.Номенклатура) + " " + Строка(Объект.Цвет) + " RAL " + Строка(Объект.RAL) + " (" + Строка(Объект.Фасовка) + ")";
	ИначеЕсли ЗначениеЗаполнено(Объект.Цвет) И НЕ ЗначениеЗаполнено(Объект.RAL) Тогда
		Объект.Наименование = Строка(Объект.Номенклатура) + " " + Строка(Объект.Цвет) + " (" + Строка(Объект.Фасовка) + ") ";
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.Цвет) И НЕ ЗначениеЗаполнено(Объект.RAL) Тогда
		Объект.Наименование = Строка(Объект.Номенклатура) + " (" + Строка(Объект.Фасовка) + ") ";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Объект.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Сырье") Тогда 
		Элементы.МинимальныйОстаток.Видимость = Истина;
		Элементы.Фасовка.Видимость = Ложь;
		Элементы.Цвет.Видимость = Ложь;
		Элементы.RAL.Видимость = Ложь;
		Элементы.Номенклатура.Видимость = Ложь;   
		Элементы.МестоХранения.Видимость = Истина;
		Элементы.Вязкость.Видимость = Ложь;
		Элементы.Перетир.Видимость = Ложь;
		Объект.ЕдиницаИзмеренияСырья = ПредопределенноеЗначение("Перечисление.ЕдиницыИзмерения.Килограмм");
				
	ИначеЕсли Объект.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Продукция") Тогда
		Элементы.МинимальныйОстаток.Видимость = Ложь;
		Элементы.Цвет.Видимость = Истина;
		Элементы.RAL.Видимость = Истина;  
		Элементы.Номенклатура.Видимость = Истина;
		Элементы.МестоХранения.Видимость = Истина;
		Элементы.Вязкость.Видимость = Истина;
		Элементы.Перетир.Видимость = Истина; 
		Объект.Родитель = ПредопределенноеЗначение("Справочник.НоменклатураМатериалы.Продукция"); 
		Объект.ЕдиницаИзмеренияСырья = ПредопределенноеЗначение("Перечисление.ЕдиницыИзмерения.Килограмм");
		
	ИначеЕсли Объект.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.УслугаРазделитель") Тогда
		Элементы.МинимальныйОстаток.Видимость = Ложь; 
		Элементы.Фасовка.Видимость = Ложь;
		Элементы.Цвет.Видимость = Ложь;
		Элементы.RAL.Видимость = Ложь; 
		Элементы.Номенклатура.Видимость = Ложь; 
		Элементы.МестоХранения.Видимость = Ложь;
		Элементы.Вязкость.Видимость = Ложь;
		Элементы.Перетир.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Не ЗначениеЗаполнено(Объект.Родитель) Тогда
		Сообщить("Не заполнена группа номенклатуры!");
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры
