
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ЦеныМатериалов.Записывать = Истина;   
	Движения.ОстаткиМатериалов.Записывать = Истина;
	Движения.СтоимостьМатериалов.Записывать = Истина;


	Для Каждого ТекСтрокаНоменклатура Из Номенклатура Цикл
		// регистр ЦеныМатериалов
		Движение = Движения.ЦеныМатериалов.Добавить();
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаНоменклатура.Наменование;
		Движение.Цена = ТекСтрокаНоменклатура.Цена;

		// регистр ОстаткиМатериалов
		Движение = Движения.ОстаткиМатериалов.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Наименование = ТекСтрокаНоменклатура.Наменование;
		Движение.Остаток = ТекСтрокаНоменклатура.Количество;    
		
		// регистр СтоимостьМатериалов 
		Движение = Движения.СтоимостьМатериалов.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Материал = ТекСтрокаНоменклатура.Наменование;
		Движение.Стоимость = ТекСтрокаНоменклатура.Сумма; 
		
	КонецЦикла;

КонецПроцедуры
