#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	СписокРецептур.Очистить();
	ЗаполнитьСписокРецептурНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
// Команда сравнения рецептур
&НаКлиенте
Процедура Сравнить(Команда)
	
	МассивРецептур = Новый Массив;
	
	Для Каждого Строка Из СписокРецептур Цикл
		Если Строка.Выбрать Тогда
			МассивРецептур.Добавить(Строка.Рецептура);
		КонецЕсли;
	КонецЦикла;
	
	Если МассивРецептур.Количество() = 0 Тогда
		ПоказатьПредупреждение(, "Не выбраны рецептуры для сравнения.");
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("СписокРецептур", МассивРецептур);	
		
	ОткрытьФорму("Обработка.ТабличныйКонструкторРецептур.Форма.ФормаСравненияРецептур", ПараметрыФормы, ЭтотОбъект);
	
	//ЭтотОбъект.Закрыть();
КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// Заполняет список рецептур на сервере.
//
&НаСервере
Процедура ЗаполнитьСписокРецептурНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Рецепт.Ссылка КАК Рецептура,
		|	Рецепт.Наименование КАК Наименование
		|ИЗ
		|	Документ.Рецепт КАК Рецепт
		|
		|УПОРЯДОЧИТЬ ПО
		|	Наименование";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	// Если структура колонок результата запроса совпадает с колонками таблицы формы,
	// метод Загрузить заполнит их автоматически.
	// Значения колонок, не указанные в запросе (например, "Выбрать"), 
	// будут заполнены значениями по умолчанию.
	СписокРецептур.Загрузить(РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

#КонецОбласти