#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	СписокРецептур.Очистить();
	ЗаполнитьСписокРецептурНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
// Команда сравнения рецептур
&НаКлиенте
Процедура Сравнить(Команда)
	МассивРецептур = Новый Массив;
	Для Каждого Строка Из СписокРецептур Цикл
		Если Строка.Выбрать Тогда
			МассивРецептур.Добавить(Строка.Рецептура);
		КонецЕсли;
	КонецЦикла;
	
	Если МассивРецептур.Количество() = 0 Тогда
		ПоказатьПредупреждение(, "Не выбраны рецептуры для сравнения.");
		Возврат;
	КонецЕсли;
	
	СравнитьНаСервере(МассивРецептур);
	
	ОткрытьФорму("Обработка.ТабличныйКонструкторРецептур.Форма.ФормаСравненияРецептур"); //, Новый Структура("МассивРецептур", МассивРецептур), ЭтотОбъект);
	
	//ЭтаФорма.Закрыть();
КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// Заполняет список рецептур на сервере.
//
&НаСервере
Процедура ЗаполнитьСписокРецептурНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Рецепт.Ссылка КАК Рецептура,
		|	Рецепт.Наименование КАК Наименование
		|ИЗ
		|	Документ.Рецепт КАК Рецепт
		|
		|УПОРЯДОЧИТЬ ПО
		|	Наименование";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	// Если структура колонок результата запроса совпадает с колонками таблицы формы,
	// метод Загрузить заполнит их автоматически.
	// Значения колонок, не указанные в запросе (например, "Выбрать"), 
	// будут заполнены значениями по умолчанию.
	СписокРецептур.Загрузить(РезультатЗапроса.Выгрузить());
	
КонецПроцедуры


&НаСервере
Процедура СравнитьНаСервере(МассивРецептур)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Рецепт.Наименование КАК Наименование,
		|	Рецепт.Ссылка,
		|	РецептСостав.Материал,
		|	РецептСостав.Материал.Наименование КАК МатериалНаименование,
		|	РецептСостав.КоличествоНаТонну
		|ИЗ
		|	Документ.Рецепт КАК Рецепт
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Рецепт.Состав КАК РецептСостав
		|		ПО Рецепт.Ссылка = Рецепт.Состав.Ссылка
		|ГДЕ
		|	Рецепт.Ссылка В (&Список)
		|
		|УПОРЯДОЧИТЬ ПО
		|	МатериалНаименование";
	
	Запрос.УстановитьПараметр("Список", МассивРецептур);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	ТаблицаКомпонентов = Новый Соответствие;
	Рецептуры = Новый Соответствие;
	
	//Список рецептур (для колонок)
	Пока Выборка.Следующий() Цикл
		
		Если Рецептуры.Получить(Выборка.Ссылка) = Неопределено Тогда
			Рецептуры.Вставить(Выборка.Ссылка, Выборка.Наименование)	
		КонецЕсли;
		
		Если Выборка.Материал = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТаблицаКомпонентов.Получить(Выборка.Материал) = Неопределено Тогда
			ТаблицаКомпонентов.Вставить(Выборка.Материал, Новый Соответствие);
		КонецЕсли;
		
		СтрокаКомпонента = ТаблицаКомпонентов[Выборка.Материал];
		СтрокаКомпонента.Вставить(Выборка.Ссылка, Выборка.КоличествоНаТонну);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти