
Процедура ОбработкаПроведения(Отказ, Режим) 

	//Движения.Рецепт.Записывать = Истина;
    Движения.СоставРецептур.Записывать = Истина;

	Для Каждого ТекСтрокаСостав Из Состав Цикл
		//Движение = Движения.Рецепт.Добавить();
		//Движение.Период = Дата;
		//Движение.Наименование = Наименование;
		//Движение.ЦенаЗаКг = ЦенаЗаКг;
		//Движение.Номенклатура = ТекСтрокаСостав.Материал;
		//Движение.КоличествоНаТонну = ТекСтрокаСостав.КоличествоНаТонну;

		Движение = Движения.СоставРецептур.Добавить();
		Движение.Период = Дата;
		Движение.Наименование = Наименование;
		Движение.ЦенаЗаКг = ЦенаЗаКг;
		Движение.Материал = ТекСтрокаСостав.Материал;
		Движение.КоличествоСырьяНаТонну = ТекСтрокаСостав.КоличествоНаТонну;
	КонецЦикла;

КонецПроцедуры
