#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ОстаткиМатериалов.Записывать = Истина;
	Движения.ЦеныМатериалов.Записывать = Истина;  
	Движения.ЦенаПокупки.Записывать = Истина;  
	Движения.СтоимостьМатериалов.Записывать = Истина;
	
	Для Каждого ТекСтрокаМатериалы Из Материалы Цикл
	// переменная остаток на складе	
    СкладскойОстаток = РаботаСоСправочниками.ОстаткиМатериалов(ТекСтрокаМатериалы.Номенклатура);
	
		// регистр ОстаткиМатериалов Приход	
		Движение = Движения.ОстаткиМатериалов.Добавить();
		Движение.ВидДвижения 	= ВидДвиженияНакопления.Приход;
		Движение.Период 		= Дата;
		Движение.Партия 		= ТекСтрокаМатериалы.Партия;
		Движение.Наименование 	= ТекСтрокаМатериалы.Номенклатура;
		Движение.Остаток 		= ТекСтрокаМатериалы.Количество;    
		
		// регистр СтоимостьМатериалов Приход	
		Движение = Движения.СтоимостьМатериалов.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Материал = ТекСтрокаМатериалы.Номенклатура;
		Движение.Стоимость = ТекСтрокаМатериалы.СредняяЦена * ТекСтрокаМатериалы.Количество; 

		
		// регистр ЦенаПокупки
		Движение = Движения.ЦенаПокупки.Добавить();
		Движение.Период = ТекущаяДатаСеанса();
		Движение.Наиенование = ТекСтрокаМатериалы.Номенклатура; 
		Движение.Цена = ТекСтрокаМатериалы.Цена;
		
		//Проверка деления на 0
		Если (ТекСтрокаМатериалы.Количество + СкладскойОстаток) <= 0 Тогда 
			Отказ = Истина;
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Остаток на складе и количество в приходной накладной меньше или равно 0!";
			Сообщение.Сообщить();
			//Сообщить("Остаток на складе и количество в приходной накладной меньше или равно 0!");
		Иначе	
			// регистр ЦеныМатериалов (средняя)
			Движение = Движения.ЦеныМатериалов.Добавить();
			Движение.Период = ТекущаяДатаСеанса();
			Движение.Номенклатура = ТекСтрокаМатериалы.Номенклатура; 
			Движение.Цена = ТекСтрокаМатериалы.СредняяЦена;
		КонецЕсли;
		
	КонецЦикла;     
	
КонецПроцедуры

# КонецОбласти