#Область ОбработчикиСобытийФормы

// Обработчик события после записи документа. Выполняет оповещение о проведении документа и обновление статуса товара.
//
// Параметры:
//   ПараметрыЗаписи - Структура - параметры, использованные при записи документа
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
    Если Объект.Проведен Тогда
    	Оповестить("Документ.ДокументПродажи.Проведен", Объект.Ссылка, ЭтотОбъект);
    КонецЕсли;
КонецПроцедуры

// Обработчик события формы "ПриОткрытии", выполняет инициализацию реквизитов документа при открытии.
//
// Параметры:
//   Отказ - Булево - Признак отказа от открытия формы
&НаКлиенте
Процедура ПриОткрытии(Отказ)
    Если Объект.Контрагент <> Неопределено И Объект.Дата <> Неопределено Тогда
        Объект.ВозрастКлиента = РаботаСоСправочниками.ВозрастКлиента(Объект.Контрагент, Объект.Дата);
    Иначе
        Объект.ВозрастКлиента = Неопределено;
    КонецЕсли;

    Для Каждого СтрокаТабличнойЧасти Из Объект.Товары Цикл
        Если СтрокаТабличнойЧасти.Номенклатура <> Неопределено Тогда
            СтрокаТабличнойЧасти.Действие = РаботаСоСправочниками.СтатусМатериала(СтрокаТабличнойЧасти.Номенклатура);
        Иначе
            СтрокаТабличнойЧасти.Действие = Неопределено;
        КонецЕсли;
    КонецЦикла;
КонецПроцедуры

// Рассчитывает возраст клиента на дату документа при создании на сервере.
//
// Параметры:
//   Отказ - Булево - Признак отказа от создания формы
//   СтандартнаяОбработка - Булево - Флаг стандартной обработки события
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Объект.Контрагент) И ЗначениеЗаполнено(Объект.Дата) Тогда
		Попытка
			Объект.ВозрастКлиента = РаботаСоСправочниками.ВозрастКлиента(Объект.Контрагент, Объект.Дата);
		Исключение
			Сообщить(ОписаниеОшибки(), СтатусСообщения.ОченьВажное);
		КонецПопытки;
	Иначе
		Объект.ВозрастКлиента = Неопределено;
	КонецЕсли;
КонецПроцедуры

// Обработчик события "ПередЗаписью" формы документа, обновляет сумму документа.
//
// Параметры:
//   Отказ - Булево - Признак отказа от записи
//   ПараметрыЗаписи - Структура - Параметры записи документа
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Объект.Сумма = Объект.Товары.Итог("Сумма");
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Обработчик события изменения даты документа. Рассчитывает возраст клиента на дату документа.
//
// Параметры:
//   Элемент - ЭлементФормы.Дата - Элемент формы, вызвавший событие изменения
&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Контрагент) И ЗначениеЗаполнено(Объект.Дата) Тогда
		Попытка
			Объект.ВозрастКлиента = РаботаСоСправочниками.ВозрастКлиента(Объект.Контрагент, Объект.Дата);
		Исключение
			Сообщить(ОписаниеОшибки(), СтатусСообщения.ОченьВажное);
		КонецПопытки;
	Иначе
		Объект.ВозрастКлиента = Неопределено;
	КонецЕсли;
КонецПроцедуры

// Обновляет возраст клиента при изменении контрагента.
//
// Параметры:
//   Элемент - Элементформы.Контрагент - элемент формы, вызвавший событие изменения
&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Контрагент) И ЗначениеЗаполнено(Объект.Дата) Тогда
		Попытка
			Объект.ВозрастКлиента = РаботаСоСправочниками.ВозрастКлиента(Объект.Контрагент, Объект.Дата);
		Исключение
			Сообщить(ОписаниеОшибки(), СтатусСообщения.ОченьВажное);
		КонецПопытки;
	Иначе
		Объект.ВозрастКлиента = Неопределено;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

// Обрабатывает событие изменения количества товара в табличной части "Товары".
//
// Параметры:
//   Элемент - ТоварыКоличествоПриИзменении - элемент формы, вызвавший событие изменения
&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)   
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	СтрокаТабличнойЧасти.Сумма = РассчитатьСумму(СтрокаТабличнойЧасти);	
КонецПроцедуры

// Обрабатывает изменение цены продажи в табличной части "Товары".
//
// Параметры:
//   Элемент - ТоварыЦенаПродажиПриИзменении - элемент формы, вызвавший событие изменения
&НаКлиенте
Процедура ТоварыЦенаПродажиПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	СтрокаТабличнойЧасти.Сумма = РассчитатьСумму(СтрокаТабличнойЧасти);	
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Рассчитывает сумму для строки табличной части документа продажи.
//
// Параметры:
//   СтрокаТабличнойЧасти - <Тип> - строка табличной части документа продажи
//
// Возвращаемое значение:
//   Число - рассчитанная сумма для строки табличной части
&НаКлиенте
Функция РассчитатьСумму(СтрокаТабличнойЧасти)
    Если СтрокаТабличнойЧасти = Неопределено Тогда
        ВызватьИсключение "Невозможно рассчитать сумму: строка табличной части не определена.";
    КонецЕсли;
    
    Если НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.Количество) ИЛИ НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.ЦенаПродажи) Тогда
        Возврат 0; 
    КонецЕсли;
    
    Если ТипЗнч(СтрокаТабличнойЧасти.Количество) <> Тип("Число") ИЛИ ТипЗнч(СтрокаТабличнойЧасти.ЦенаПродажи) <> Тип("Число") Тогда
        ВызватьИсключение "Невозможно рассчитать сумму: неверный тип данных.";
    КонецЕсли;
    
    Возврат СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.ЦенаПродажи;
КонецФункции

#КонецОбласти