&НаСервереБезКонтекста
Функция ПолучитьРодителя(НоменклатураМатериалы) 
// Функция передает в процедуру единицу измерения материала из справочника НоменклатураМатериалы

	Возврат НоменклатураМатериалы.Родитель; 
	                     	
КонецФункции

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)   
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.ЦенаПродажи;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПродажиПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.ЦенаПродажи;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("Документ.ДокументПродажи.Проведен", Объект.Ссылка, ЭтотОбъект);
	//Проставляет статус товара
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	Для Каждого СтрокаТабличнойЧасти Из Объект.Товары Цикл
		СтрокаТабличнойЧасти.Действие = РаботаСоСправочниками.СтатусМатериала(СтрокаТабличнойЧасти.Номенклатура);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)  
	Объект.ВозрастКлиента = РаботаСоСправочниками.ВозрастКлиента(Объект.Контрагент, Объект.Дата);
	
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	Для Каждого СтрокаТабличнойЧасти Из Объект.Товары Цикл
		СтрокаТабличнойЧасти.Действие = РаботаСоСправочниками.СтатусМатериала(СтрокаТабличнойЧасти.Номенклатура);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	//СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	//Для Каждого СтрокаТабличнойЧасти Из Объект.Товары Цикл
	//	Если СтрокаТабличнойЧасти.Количество = РаботаСоСправочниками.ОстаткиМатериалов(СтрокаТабличнойЧасти.Номенклатура) Тогда  
	//		СтрокаТабличнойЧасти.Действие = ПредопределенноеЗначение("Перечисление.СтатусыГотовностиПродукции.Отгружен");
	//	КонецЕсли;  
	//КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.ВозрастКлиента = РаботаСоСправочниками.ВозрастКлиента(Объект.Контрагент, Объект.Дата);
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Объект.ВозрастКлиента = РаботаСоСправочниками.ВозрастКлиента(Объект.Контрагент, Объект.Дата);
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	Объект.ВозрастКлиента = РаботаСоСправочниками.ВозрастКлиента(Объект.Контрагент, Объект.Дата);
КонецПроцедуры
