#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДобавитьВТаблицу(Команда)
	ПараметрыФормы = Новый Структура;
	ОписаниеОповещения = Новый ОписаниеОповещения("ПодборРецептурЗавершен", ЭтотОбъект);
	ОткрытьФорму("Обработка.ТабличныйКонструкторРецептур.Форма.ПодборРецептур", ПараметрыФормы, , , , , ОписаниеОповещения);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура ПодборРецептурЗавершен(РезультатЗакрытия, ДопПараметры) Экспорт
	Если РезультатЗакрытия <> Неопределено Тогда
		// TODO: Здесь должна быть логика добавления выбранного рецепта в таблицу формы
		// Например: НоваяСтрока = Объект.ТаблицаРецептур.Добавить();
		// ЗаполнитьЗначенияСвойств(НоваяСтрока, РезультатЗакрытия);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти