#Область ОбработчикиСобытийФормы


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	  
	Если Параметры = Неопределено Тогда
    	Возврат;
	КонецЕсли;

	//ПостроитьМатрицу();
    Если Не Параметры.Свойство("МассивРецептур") Тогда //("ДанныеСравнения") Тогда
		Возврат;
    КонецЕсли;
    
	Данные = Параметры.ДанныеСравнения.Получить();
	
    Рецептуры = Данные.Рецептуры;
    Компоненты = Данные.Компоненты;
    ПорядокРецептур = Данные.ПорядокРецептур;
    ПорядокКомпонентов = Данные.ПорядокКомпонентов;
	
	ТабДокумент.Очистить();
		
    // ===== ШАПКА =====
	Строка = 1;
	Колонка = 1;    
    
	Область = ТабДокумент.Область(Строка, Колонка);
	Область.Текст = "Компонент";
	Область.Шрифт = Новый Шрифт(,, Истина);
	Область.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
	
	Колонка = Колонка + 1;
	
	Для Каждого СсылкаРецепта Из ПорядокРецептур Цикл
		Область = ТабДокумент.Область(Строка, Колонка);
		Область.Текст = Рецептуры[СсылкаРецепта];
		Область.Шрифт = Новый Шрифт(,, Истина);
		//Область.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
        
        Колонка = Колонка + 1;
	КонецЦикла;
	
	// ===== СТРОКИ КОМПОНЕНТОВ =====
	Строка = 2;
	
	Для Каждого ПараКомпонента Из Компоненты Цикл
		Материал = ПараКомпонента.Ключ;
		СтрокаКомпонента = ПараКомпонента.Значение;
		
		Если Материал = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если Материал.ПометкаУдаления Тогда
			Продолжить;
		КонецЕсли;
		
		Если Материал.ЭтоГруппа Тогда
			Продолжить;
		КонецЕсли;

		Колонка = 1;		
		ТабДокумент.Область(Строка, Колонка).Текст = Материал.Наименование;
		Колонка = Колонка + 1;
	
		Для Каждого СсылкаРецепта Из ПорядокРецептур Цикл
			Значение = СтрокаКомпонента.Получить(СсылкаРецепта);
			Если Значение = Неопределено Тогда
				Значение = 0;
			КонецЕсли;
			ТабДокумент.Область(Строка, Колонка).Текст = Значение;
			Колонка = Колонка + 1;
		КонецЦикла;

		Строка = Строка + 1;		
		
	КонецЦикла;
	
	// ===== АВТОШИРИНА =====
	//ТабДокумент.УстановитьРастягиваниеПоГоризонтали(Колонка);
 	
	
КонецПроцедуры
#КонецОбласти

//#Область СлужебныеПроцедурыИФункции


//#КонецОбласти