
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
    // 1. Получить ссылки на рецептуры
	Данные = ПолучитьДанныеСравнения(Параметры.СписокРецептур);

    // 2. Построить табличный документ
	//ПостроитьТабДокумент(Данные);
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеСравнения(СписокРецептур)

    // -----------------------------
    // 1. Получаем состав рецептур
    // -----------------------------
    
Запрос = Новый Запрос;
Запрос.Текст =
	"ВЫБРАТЬ
	|	РецептСостав.Ссылка КАК Рецептура,
	|	РецептСостав.Ссылка.Наименование КАК НаименованиеРецептуры,
	|	РецептСостав.НомерСтроки КАК НомерСтроки,
	|	РецептСостав.Материал,
	|	РецептСостав.Материал.Наименование,
	|	РецептСостав.КоличествоНаТонну КАК Количество
	|ИЗ
	|	Документ.Рецепт.Состав КАК РецептСостав
	|ГДЕ
	|	РецептСостав.Ссылка В (&СписокРецептур)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";

Запрос.УстановитьПараметр("СписокРецептур", СписокРецептур);

РезультатЗапроса = Запрос.Выполнить();

Выборка = РезультатЗапроса.Выбрать();

	ТаблицаКомпонентов = Новый Соответствие;   // Материал → Соответствие(Рецептура → Количество)
	Рецептуры = Новый Соответствие;            // Ссылка → Наименование
	ПорядокРецептур = Новый Массив;
	ПорядокКомпонентов = Новый Массив;


Пока Выборка.Следующий() Цикл
	
        // порядок рецептур
	Если Рецептуры.Получить(Выборка.Рецептура) = Неопределено Тогда
		Рецептуры.Вставить(Выборка.Рецептура, Выборка.НаименованиеРецептуры);
		ПорядокРецептур.Добавить(Выборка.Рецептура);
	КонецЕсли;
	
	
КонецЦикла;

КонецФункции

&НаКлиенте
Процедура ПостроитьТабДокумент(Данные)
	
КонецПроцедуры

//#Область СлужебныеПроцедурыИФункции


//#КонецОбласти