#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДобавитьВТаблицу(Команда)
	//ПараметрыФормы = Новый Структура;
	//ОписаниеОповещения = Новый ОписаниеОповещения("ПодборРецептурЗавершен", ЭтотОбъект);
	ОткрытьФорму("Обработка.ТабличныйКонструкторРецептур.Форма.ПодборРецептур"); //, ПараметрыФормы, , , , , ОписаниеОповещения);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура ПодборРецептурЗавершен(РезультатЗакрытия, ДопПараметры) Экспорт
	Если РезультатЗакрытия <> Неопределено Тогда
		Таб = ТабДокумент;
		Колонка = 2;
		Для Каждого Рец Из РезультатЗакрытия Цикл
			Таб.Область(1, Колонка, Рец).Текст = "Привет";
			Колонка = Колонка + 1;
		КонецЦикла;
		//НоваяСтрока = Объект.ТаблицаРецептур.Добавить();
		//ЗаполнитьЗначенияСвойств(НоваяСтрока, РезультатЗакрытия);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти