#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
    // 1. Получить ссылки на рецептуры
	Данные = ПолучитьДанныеСравнения(Параметры.СписокРецептур);

    // 2. Построить табличный документ
	ПостроитьТабДокумент(Данные);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьДанныеСравнения(СписокРецептур)

    // -----------------------------
    // 1. Получаем состав рецептур
    // -----------------------------
    
Запрос = Новый Запрос;
Запрос.Текст =
	"ВЫБРАТЬ
	|	РецептСостав.Ссылка КАК Рецептура,
	|	РецептСостав.Ссылка.Наименование КАК НаименованиеРецептуры,
	|	РецептСостав.НомерСтроки КАК НомерСтроки,
	|	РецептСостав.Материал,
	|	РецептСостав.Материал.Наименование,
	|	РецептСостав.КоличествоНаТонну КАК Количество
	|ИЗ
	|	Документ.Рецепт.Состав КАК РецептСостав
	|ГДЕ
	|	РецептСостав.Ссылка В (&СписокРецептур)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";

Запрос.УстановитьПараметр("СписокРецептур", СписокРецептур);

РезультатЗапроса = Запрос.Выполнить();

Выборка = РезультатЗапроса.Выбрать();

	ТаблицаКомпонентов = Новый Соответствие;   // Материал → Соответствие(Рецептура → Количество)
	Рецептуры = Новый Соответствие;            // Ссылка → Наименование
	ПорядокРецептур = Новый Массив;
	ПорядокКомпонентов = Новый Массив;


Пока Выборка.Следующий() Цикл
	
	// порядок рецептур
	Если Рецептуры.Получить(Выборка.Рецептура) = Неопределено Тогда
		Рецептуры.Вставить(Выборка.Рецептура, Выборка.НаименованиеРецептуры);
		ПорядокРецептур.Добавить(Выборка.Рецептура);
	КонецЕсли;

	// пустые строки состава пропускаем
	Если Выборка.Материал = Неопределено Тогда
		Продолжить;
	КонецЕсли;	
	
	// порядок компонентов как в документе
	Если ПорядокКомпонентов.Найти(Выборка.Материал) = Неопределено Тогда
		ПорядокКомпонентов.Добавить(Выборка.Материал);
	КонецЕсли;
	
	// матрица количеств
	Если ТаблицаКомпонентов.Получить(Выборка.Материал) = Неопределено Тогда
		ТаблицаКомпонентов.Вставить(Выборка.Материал, Новый Соответствие);
	КонецЕсли;

	ТаблицаКомпонентов[Выборка.Материал].Вставить(Выборка.Рецептура, Выборка.Количество);
	
КонецЦикла;

	 // --------------------------------
    // 3. Возврат результата
    // --------------------------------

	Данные = Новый Структура;
	Данные.Вставить("Рецептуры", Рецептуры);
	Данные.Вставить("ПорядокРецептур", ПорядокРецептур);
	Данные.Вставить("ПорядокКомпонентов", ПорядокКомпонентов);
	Данные.Вставить("ТаблицаКомпонентов", ТаблицаКомпонентов);
	
	Возврат Данные;
	
КонецФункции

&НаСервере
Процедура ПостроитьТабДокумент(Данные)
	
	Если Данные = Неопределено Тогда
    	Возврат;
	КонецЕсли;

	//Данные = Параметры.ДанныеСравнения.Получить();
	
    Рецептуры = Данные.Рецептуры;
    Компоненты = Данные.ТаблицаКомпонентов;
    ПорядокРецептур = Данные.ПорядокРецептур;
    ПорядокКомпонентов = Данные.ПорядокКомпонентов;
	
	ТабДокумент.Очистить();
		
    // ===== ШАПКА =====
	Строка = 1;
	Колонка = 1;    
    
	Область = ТабДокумент.Область(Строка, Колонка);
	Область.Текст = "Компонент";
	Область.Шрифт = Новый Шрифт(,, Истина);
	Область.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
	
	Колонка = Колонка + 1;
	
	Область = ТабДокумент.Область(Строка, Колонка);
	Область.Текст = "Цена";
	Область.Шрифт = Новый Шрифт(,, Истина);
	Область.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;	
	
	Колонка = Колонка + 1;
	
	Область = ТабДокумент.Область(Строка, Колонка);
	Область.Текст = "Остаток";
	Область.Шрифт = Новый Шрифт(,, Истина);
	Область.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;	
	
	Колонка = Колонка + 1;
	
	Для Каждого СсылкаРецепта Из ПорядокРецептур Цикл
		Область = ТабДокумент.Область(Строка, Колонка);
		Область.Текст = Рецептуры[СсылкаРецепта];
		Область.Шрифт = Новый Шрифт(,, Истина);
		//Область.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
        
        Колонка = Колонка + 1;
	КонецЦикла;
	
	// ===== СТРОКИ КОМПОНЕНТОВ =====
	Строка = 2;
	
	Для Каждого ПараКомпонента Из Компоненты Цикл
		Материал = ПараКомпонента.Ключ;
		СтрокаКомпонента = ПараКомпонента.Значение;
		
		Если Материал = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если Материал.ПометкаУдаления Тогда
			Продолжить;
		КонецЕсли;
		
		Если Материал.ЭтоГруппа Тогда
			Продолжить;
		КонецЕсли;

		Колонка = 1;		
		ТабДокумент.Область(Строка, Колонка).Текст = Материал.Наименование;
		Колонка = 3;
		Колонка = Колонка + 1;
	
		Для Каждого СсылкаРецепта Из ПорядокРецептур Цикл
			Значение = СтрокаКомпонента.Получить(СсылкаРецепта);
			Если Значение = Неопределено Тогда
				Значение = 0;
			КонецЕсли;
			ТабДокумент.Область(Строка, Колонка).Текст = Значение;
			Колонка = Колонка + 1;
		КонецЦикла;

		Строка = Строка + 1;		
		
	КонецЦикла;
	
	// ===== АВТОШИРИНА =====
	//ТабДокумент.УстановитьРастягиваниеПоГоризонтали(Колонка);
	
КонецПроцедуры

#КонецОбласти